{
    "Tutorial Quests": {
        "name": "新手教程",
        "description": {
            "A short set of quests to get you going.": "一组简短的任务，可以让你了解游戏机制"
        },
        "descriptions": {
            "Defeat the Pokémon. Click to deal damage!": "点击造成伤害，以击败宝可梦",
            "Capture 1 Pokémon. When you defeat a Pokémon, a Poké Ball is thrown and you have a chance to capture it.": "捕捉1只宝可梦。当你打败宝可梦时，扔出一个精灵球，你将有机会抓住它",
            "Defeat 10 Pokémon on Route 2. Click Route 2 on the map to move there and begin fighting.": "在２号道路击败10只宝可梦，点击地图上的２号道路，移动到那里并开始战斗",
            "Go back to Pallet Town and say bye to mom.": "回去真新镇跟妈妈说再见",
            "Buy 10 Poké Balls.": "购买10个精灵球",
            "Talk to the Old Man in Viridian City to learn about catching.": "跟常青市的老人学习如何捕捉",
            "Use what you've learned to catch 5 Pidgey. Talk to the Old Man again if you need a reminder.": "用你学到的方法去抓5只波波。如果你需要提醒，去和老人谈谈",
            "Buy the Dungeon Ticket from Viridian City Shop.": "在常青市商店购买地牢门票",
            "Gather 50 Dungeon Tokens by (re)capturing Pokémon, then clear the Viridian Forest dungeon.": "捕捉重复的宝可梦，收集50个地牢蓝币，然后清理常青森林",
            "Defeat Pewter City Gym. Click the town on the map to move there, then click the Gym button to start the battle.": "击败深灰市道馆。点击地图上的城镇移动到那里，然后点击道馆按钮开始战斗"
        }
    },
    "Team Rocket": {
        "name": "火箭队",
        "description": {
            "Some nasty villains are up to no good.": "有些可恶的反派不怀好意"
        },
        "descriptions": {
            "Illegal activity is afoot. Clear the Rocket Game Corner in Celadon City.": "正在进行非法活动。前往玉虹市清理火箭游戏城",
            "Team Rocket has occupied Silph Co. Clear Silph Co. in Saffron City to find the Card Key.": "前往金黄市，清理被火箭队占领的西尔佛公司，以找到卡片钥匙",
            "Blue is getting in your way. Defeat him in Silph Co.": "青绿挡住了你的路。在西尔佛公司击败他",
            "Team Rocket has occupied Silph Co. Clear Silph Co. in Saffron City once more to foil their plans.": "再次前往金黄市挫败他们的计划，清理被火箭队占领的西尔佛公司",
            "If you take down Team Rocket's leader one more time they will surely never come back from this! Clear Viridian City Gym.": "如果你再击败火箭队的首领，他们肯定再也不会回来了！击败常青市道馆"
        }
    },
    "Bill's Grandpa Treasure Hunt": {
        "name": "正辉的爷爷的寻宝游戏",
        "description": {
            "Check the hints and bring Bill's Grandpa the Pokémon he wants to see.": "查看任务提示，将正辉的爷爷想要的宝可梦带给他看"
        },
        "descriptions": {
            "Talk to Bill's Grandpa in Bill's House.": "在正辉的家里跟正辉的爷爷谈谈",
            "Bill's Grandpa wants you to catch a Pokémon that is pink and like a balloon.": "正辉的爷爷想让你捕捉一只像粉红色气球一样的宝可梦",
            "Catch the desired Pokémon.": "捕捉想要的宝可梦",
            "Defeat 100 Normal-type Pokémon.": "击败100只一般属性宝可梦",
            "Show your Jigglypuff to Bill's Grandpa.": "向正辉的爷爷展示你的胖丁",
            "Bill's Grandpa wants you to catch a Pokémon that is round, blue, and has leaves growing on its head.": "正辉的爷爷想让你抓一只蓝色圆形且头上长着叶子的宝可梦",
            "Defeat 100 Grass-type Pokémon.": "击败100只草属性宝可梦",
            "Show your Oddish to Bill's Grandpa.": "向正辉的爷爷展示你的走路草",
            "Bill's Grandpa wants you to catch a Pokémon that has a red sphere in its body and is shaped like a star.": "正辉的爷爷想让你抓住一只身体里有一个红星的宝可梦",
            "Defeat 100 Water-type Pokémon.": "击败100只水属性宝可梦",
            "Show your Staryu to Bill's Grandpa.": "向正辉的爷爷展示你的海星星",
            "Bill's Grandpa wants you to catch a Pokémon that is very loyal and supposedly roars pretty well.": "正辉的爷爷想让你抓一只忠诚且会咆哮的宝可梦",
            "Defeat 100 Fire-type Pokémon.": "击败100只火属性宝可梦",
            "Show your Growlithe to Bill's Grandpa.": "向正辉的爷爷展示你的卡蒂狗",
            "Bill's Grandpa wants you to catch a Pokémon that has a yellow body and red cheeks.": "正辉的爷爷想让你抓一只黄色身体、红色脸颊的的宝可梦",
            "Defeat 100 Electric-type Pokémon.": "击败100只电属性宝可梦",
            "Show your Pikachu to Bill's Grandpa.": "向正辉的爷爷展示你的皮卡丘",
            "Bill's Grandpa would like to have a battle with you!": "正辉的爷爷想和你进行一场战斗！”",
            "Talk to Bill's Grandpa one last time.": "最后和正辉的爷爷谈谈"
        }
    },
    "Mining Expedition": {
        "name": "采矿探险",
        "description": {
            "Explore the underground!": "探索地下世界"
        },
        "descriptions": {
            "Buy the Explorer Kit from Cinnabar Island Shop.": "从红莲镇商店购买探险套装",
            "Collect all buried treasure 5 times in the Underground mines.": "在地下矿场挖掘全部矿藏5次"
        }
    },
    "Bill's Errand": {
        "name": "正辉的差事",
        "description": {
            "Bill has asked you to journey to the Sevii Islands with him to set up a digital connection to mainland Kanto.": "正辉让你和他一起去七之岛建立一个与关都大陆的数字连接"
        },
        "descriptions": {
            "Use the Subregional Travel button at the top of the map to travel to the Sevii Islands and speak with Celio on One Island.": "点击地图上方的子区域旅行按钮到达七之岛，跟第１岛的锦辉谈谈",
            "Ask the Game Corner owner on Two Island about the meteorite.": "询问第２岛游戏城老板关于陨石的事",
            "A biker gang has invaded Three island. They will not let you continue to Berry Forest. Defeat the Biker Goons.": "飙车族入侵了第３岛并封锁了前往树果森林的道路，请击败他们",
            "Defeat the biker gang's leader.": "击败飞车党首领",
            "Find Lostelle. Clear Berry Forest.": "找到小迷并清理树果森林",
            "Lostelle has been found. Return to the Game Corner owner on Two Island.": "小迷已经找到了，回去第２岛游戏城老板那",
            "Deliver the meteorite to Celio on One Island.": "把陨石交给第１岛的锦辉"
        }
    },
    "Persons of Interest": {
        "name": "感兴趣的人",
        "description": {
            "Some people want to talk to you.": "有些人想和你谈谈."
        },
        "descriptions": {
            "Talk to the Breeder in Saffron City.": "前往金黄市与培育家谈谈",
            "Talk to the Gem Scientist in Pewter City.": "前往深灰市与宝石大师谈谈"
        }
    },
    "The Sick Ampharos": {
        "name": "生病的电龙",
        "description": {
            "Jasmine's Ampharos seems to be sick!": "阿蜜的电龙似乎病了！"
        },
        "descriptions": {
            "Clear the Olivine Lighthouse dungeon in Olivine City.": "清理浅葱市的浅葱灯塔地牢",
            "Talk to Jasmine in the Olivine Lighthouse.": "在浅葱灯塔和阿蜜谈谈",
            "Talk to the Pharmacist in Cianwood City.": "在湛蓝市和药剂师谈谈",
            "The Pharmacist said he needs some time to finish Amphys medicine. Clear the Cianwood City Gym in the meantime.": "药剂师说他需要一些时间来完成光儿的药物。与此同时清理湛蓝市道馆",
            "Give Amphy their medicine in the Olivine Lighthouse.": "在浅葱灯塔将药物给光儿"
        }
    },
    "Team Rocket Again": {
        "name": "又是火箭队",
        "description": {
            "Team Rocket is up to no good again!": "火箭队又要干坏事了!"
        },
        "descriptions": {
            "Defeat the rampaging Red Gyarados!": "击败狂暴的红色暴鲤龙！",
            "Clear the Team Rocket's Hideout dungeon in Mahogany Town": "清理卡吉镇的火箭队基地",
            "Clear the Radio Tower dungeon in Goldenrod City": "清理满金市的满金电台"
        }
    },
    "The Legendary Beasts": {
        "name": "三圣兽",
        "description": {
            "Investigate the legends surrounding the strange Burned Tower in Ecruteak City.": "调查缘朱市中关于烧焦塔奇怪的传说"
        },
        "descriptions": {
            "Talk to Eusine in Ecruteak City.": "前往缘朱市与水京谈谈",
            "Clear the Burned Tower.": "清理烧焦塔",
            "Defeat Silver.": "击败小银",
            "Talk to Pokéfan Derek in Ecruteak City.": "前往缘朱市与发烧友俱乐部见栄晴谈谈",
            "Catch the Legendary Beasts.": "捕捉三圣兽",
            "Catch Raikou.": "捕捉雷公",
            "Catch Entei.": "捕捉炎帝",
            "Catch Suicune.": "捕捉水君"
        }
    },
    "Eusine's Chase": {
        "name": "水京的追逐",
        "description": {
            "Eusine is looking for Suicune.": "水京正在寻找水君."
        },
        "descriptions": {
            "Find Suicune.": "寻找水君",
            "Talk to Eusine in Cianwood City.": "前往湛蓝市与水京谈谈",
            "Defeat Eusine.": "击败水京",
            "Talk to Eusine in Mahogany Town.": "前往卡吉镇与水京谈谈",
            "Talk to Eusine in Vermilion City.": "前往枯叶市与水京谈谈",
            "Talk to Eusine in Fuchsia City.": "前往浅红市与水京谈谈",
            "Talk to Eusine in Bill's House.": "在正辉的家中和水京对话",
            "Capture Suicune.": "捕捉水君"
        }
    },
    "Whirl Guardian": {
        "name": "漩涡岛守护者",
        "description": {
            "The Kimono Girls of Ecruteak City need help.": "缘朱市的和服女孩们需要帮助."
        },
        "descriptions": {
            "Talk to Kimono Girl Zuki in Violet City.": "前往桔梗市与和服女孩小玉谈谈",
            "Hatch 25 Eggs.": "孵化25个蛋",
            "Talk to Kimono Girl Naoko in the Ilex Forest.": "前往栎树林与和服女孩小梅谈谈",
            "Clear Ilex Forest to lead Naoko to safety.": "清理栎树林，把小梅带到安全的地方",
            "Talk to Kimono Girl Miki at the Ecruteak City Dance Theatre.": "前往缘朱市舞蹈剧场与和服女孩小鹃谈谈",
            "Talk to Kimono Girl Sayo in the Ice Path.": "前往冰雪小径与和服女孩樱花谈谈",
            "Clear the Ice Path to give Sayo a push.": "清理冰雪小径，推樱花一把",
            "Talk to Kimono Girl Kuni in Goldenrod City.": "前往满金市与和服女孩小桃谈谈",
            "Clear the Radio Tower to get rid of any lingering Team Rocket activity.": "清理满金电台，以阻止火箭队的行动",
            "Meet the Kimono Girls at the Whirl Islands.": "前往漩涡岛与和服女孩们见面",
            "Catch Lugia in the Whirl Islands.": "在漩涡岛捕捉洛奇亚"
        }
    },
    "Rainbow Guardian": {
        "name": "虹色守护者",
        "description": {
            "The Kimono Girls of Ecruteak City wish to speak with you again.": "缘朱市的和服女孩们想再和你谈谈"
        },
        "descriptions": {
            "Meet the Kimono Girls at the Ecruteak Dance Theatre.": "前往缘朱市舞蹈剧场与和服女孩们见面",
            "Prove your abilities as a trainer to the Kimono Girls of Ecruteak City.": "向缘朱市的和服女孩们证明你训练家的能力",
            "Catch Ho-Oh in the Tin Tower.": "在铃铛塔捕捉凤王"
        }
    },
    "Unfinished Business": {
        "name": "未竟之事",
        "description": {
            "A request from Professor Oak.": "来自大木博士的请求."
        },
        "descriptions": {
            "Talk to Professor Oak in Pallet Town.": "前往真新镇与大木博士谈谈",
            "Talk to Professor Ivy in her lab in the Sevii Islands.": "前往七之岛的实验室与内木博士谈谈",
            "Deliver the GS Ball to Professor Oak in Pallet Town.": "将ＧＳ球送给真新镇的大木博士处",
            "Deliver the GS Ball to Kurt in Azalea Town in Johto.": "将ＧＳ球送给*城都*桧皮镇的钢铁",
            "Talk to Kurt again after becoming Champion of Johto.": "成为城都地区的冠军后再次与钢铁对话",
            "Talk to Professor Oak in Azalea Town.": "前往桧皮镇与大木博士谈谈",
            "Investigate the shrine in Ilex Forest.": "调查栎树林的神殿",
            "Defeat the strange Pichu.": "击败奇怪的皮丘",
            "Investigate the Time Distortion in Tohjo Falls.": "调查都城瀑布的时空扭曲",
            "Defeat Giovanni.": "击败坂木",
            "Play with the Celebi in Ilex Forest.": "在栎树林中与时拉比玩耍"
        }
    },
    "Land vs. Water": {
        "name": "固拉多VS盖欧卡",
        "description": {
            "Put a stop to the schemes of Team Aqua and Team Magma!": "阻止海洋队和熔岩队的阴谋!"
        },
        "descriptions": {
            "Stop Team Magma at Mt. Chimney Crater.": "前往烟囱山火山口阻止熔岩队",
            "Stop Team Aqua at the Weather Institute.": "前往天气研究所阻止海洋队",
            "Raid the Team Magma hideout.": "突袭熔岩队基地",
            "Raid the Team Aqua hideout.": "突袭海洋队基地",
            "Team Aqua's leader Archie escaped from their hideout. Find him in the Seafloor Cavern and put a stop to this once and for all!": "海洋队队长水梧桐 从基地中逃了出来。前往海底洞窟找到他，结束这一切"
        }
    },
    "The Weather Trio": {
        "name": "丰缘三神",
        "description": {
            "Put an ancient battle to rest.": "平息一场古老的战争"
        },
        "descriptions": {
            "Investigate the commotion in Sootopolis City.": "调查琉璃市的骚乱",
            "Explore the Cave of Origin to find Wallace.": "前往觉醒神殿寻找米可利",
            "Talk to Wallace in the Cave of Origin to learn how to stop Kyogre and Groudon from fighting.": "前往觉醒神殿与米可利谈谈，学习如何阻止盖欧卡和固拉多的战斗",
            "Climb the Sky Pillar to find the super-ancient Pokémon Rayquaza.": "前往天空之柱寻找超古代宝可梦裂空座",
            "Return to Sootopolis City to see what Rayquaza will do.": "回到琉璃市，看看裂空座会怎么做",
            "Talk to Wallace in the Cave of Origin about the aftermath of the battle.": "前往觉醒神殿与米可利谈谈战斗的后果",
            "Catch the Weather Trio.": "捕捉丰缘三神",
            "Capture Rayquaza.": "捕捉裂空座",
            "Capture Kyogre.": "捕捉盖欧卡",
            "Capture Groudon.": "捕捉固拉多"
        }
    },
    "Mystery of Deoxys": {
        "name": "神秘的代欧奇希斯",
        "description": {
            "Discover the mystery of Deoxys.": "找到代欧奇希斯"
        },
        "descriptions": {
            "Defeat 50 Pokémon on Hoenn Route 129.": "在１２９号水路（丰缘）击败50个宝可梦",
            "Defeat 500 Psychic-type Pokémon.": "击败500只超能力属性宝可梦",
            "Capture or hatch 200 Psychic-type Pokémon.": "捕捉或孵化200只超能力属性宝可梦",
            "Enter the Battle Frontier and defeat stage 100.": "通过对战开拓区100层"
        }
    },
    "The Eon Duo": {
        "name": "无限宝可梦",
        "description": {
            "Track down the elusive Eon Duo.": "追寻难以捉摸的无限宝可梦"
        },
        "descriptions": {
            "Watch a news report in Littleroot Town about a mysterious Pokémon.": "前往未白镇观看一则关于神秘宝可梦的新闻报道",
            "Change channels to watch a different TV station in Littleroot town.": "前往未白镇，换台看不同的电视节目",
            "Go to Hoenn Pokémon League to claim your Eon ticket.": "前往丰源宝可梦联盟领取无限船票",
            "Claim your Eon Ticket in the Start Menu and investigate the Southern Island.": "在开始菜单中领取您的无限船票，并调查南方孤岛",
            "Catch the Eon Duo.": "捕捉无限宝可梦",
            "Catch Latias.": "捕捉拉帝亚斯",
            "Catch Latios.": "捕捉拉帝欧斯"
        }
    },
    "Celio's Errand": {
        "name": "锦辉的差事",
        "description": {
            "Celio has asked you to help him set up a digital connection between the Sevii Islands and Hoenn.": "锦辉让你帮他建立七之岛和丰缘之间的数字连接"
        },
        "descriptions": {
            "Speak with Celio on One Island in Sevii.": "前往七之岛中的第１岛与锦辉谈谈",
            "Eavesdrop on the Team Rocket Grunts at Mt. Ember.": "前往灯火山窃听火箭队手下",
            "Two Team Rocket Grunts are blocking the entrance to Ruby Path. Defeat them.": "2个火箭队手下封锁了红宝石之路的入口，请打败他们",
            "Locate the Ruby. Clear Ruby Path in Mt. Ember.": "定位红宝石，清理灯火山的红宝石之路",
            "Take the Ruby in Ruby Path": "前往红宝石之路带走红宝石",
            "Return the Ruby to Celio on One Island": "把红宝石还给第１岛上的锦辉",
            "Help Lorelei with Team Rocket Grunts by clearing Icefall Cave on Four Island.": "协助科拿清理第４岛冻瀑洞窟的火箭队手下",
            "Talk to Lorelei in Icefall Cave": "前往冻瀑洞窟与科拿谈谈",
            "Talk to Gideon in Dotted Hole": "前往点之穴与澄夫谈谈",
            "Defeat the Three Team Rocket Grunts in Rocket Warehouse.": "前往火箭队仓库击败3个火箭队手下",
            "Defeat Team Rocket Executive Ariana in Rocket Warehouse.": "前往火箭队仓库击败火箭队干部雅典娜",
            "Defeat Team Rocket Executive Archer in Rocket Warehouse.": "前往火箭队仓库击败火箭队干部阿波罗",
            "Defeat Scientist Gideon to reclaim the Sapphire.": "击败研究员澄夫以夺回蓝宝石",
            "Return the Sapphire to Celio on One Island": "把蓝宝石还给第１岛上的锦辉"
        }
    },
    "Team Rocket's Pinkan Theme Park": {
        "name": "火箭队的粉红主题公园",
        "description": {
            "Help Team Rocket build a theme park on Pinkan Island?": "帮助火箭队在平柑岛建一个主题公园?"
        },
        "descriptions": {
            "Talk to Team Rocket on Pinkan Island to hear about their plans.": "与平柑岛的火箭队谈谈，听听他们的计划",
            "Mutate and harvest 1 Pinkan Berry at the farm.": "在农场变异并收获1个Pinkan树果",
            "Help Team Rocket recruit some Pinkan Pokémon": "帮助火箭队招募一些粉色宝可梦",
            "Defeat 500 Pokémon on Pinkan Forest in Sevii Islands 4567.": "前往第４５６７岛的Pinkan Forest击败500只宝可梦",
            "Defeat 500 Pokémon on Pinkan Plains in Sevii Islands 4567.": "前往第４５６７岛的Pinkan Plains击败500只宝可梦",
            "Collect Fairy Gems and Pixie Plates": "收集妖精宝石和妖精石板",
            "Gain 1,000 Fairy gems.": "获得1000个妖精宝石",
            "Gain 10 Pixie Plates": "获得10个妖精石板",
            "Talk to Team Rocket on Pinkan Island to open the theme park!": "与平柑岛的火箭队谈谈，以开放主题公园",
            "Defeat Team Rocket Jessie & James on Pinkan Island.": "前往平柑岛击败火箭队武藏和小次郎",
            "Oh no! Officer Jenny has showed up. She's not happy! No time to plead your case, it's time to battle!": "哦，不！君莎小姐出现了。她不开心！没时间为你狡辩了，是战斗的时候了"
        }
    },
    "The Three Golems": {
        "name": "三只传说的巨人",
        "description": {
            "Discover the secrets of the Sealed Chamber.": "找出布告石室的秘密."
        },
        "descriptions": {
            "Enter the Sealed Chamber to find clues.": "前往布告石室寻找线索",
            "Investigate the strange markings in the Sealed Chamber.": "调查布告石室里的奇怪标记",
            "Navigate the maze inside the Sealed Chamber.": "穿越布告石室的迷宫",
            "Investigate the hidden message at the end of the Sealed Chamber maze.": "在布告石室的尽头调查隐藏的信息",
            "Explore Hoenn by defeating Pokémon on the hinted routes to release the Regi Trio.": "探索丰缘地区，在提示路线上击败宝可梦，以释放三神柱",
            "Release Regirock": "释放雷吉洛克",
            "Release Regice": "释放雷吉艾斯",
            "Release Registeel": "释放雷吉斯奇鲁",
            "Catch the Regi Trio.": "捕捉三神柱",
            "Capture Regirock.": "捕捉雷吉洛克",
            "Capture Regice.": "捕捉雷吉艾斯",
            "Capture Registeel.": "捕捉雷吉斯奇鲁"
        }
    },
    "Wish Maker": {
        "name": "许愿星",
        "description": {
            "Harness the power of the Millennium Comet and make a wish!": "使用千年彗星的力量，许个愿吧！"
        },
        "descriptions": {
            "Attend the opening ceremony of the Millennium Festival near Lavaridge Town.": "在釜炎镇附近参加宝可梦游乐园开幕式",
            "Defeat Team Rocket Jessie & James at the Millennium Festival near Lavaridge Town.": "前往釜炎镇附近的宝可梦游乐园击败火箭队武藏和小次郎",
            "Learn the legend of the Millennium Comet from Butler near Lavaridge Town.": "从釜炎镇附近的巴特勒那里了解千年彗星的传说",
            "Climb to the Mt. Chimney Crater to get a better view of the Millennium Comet as it passes.": "前往烟囱山火山口，当千年彗星经过时，能够更好地观察它",
            "You are being stalked by Absol, the Disaster Pokémon. Capture it or hatch your own to befriend it.": "你被灾难宝可梦阿勃梭鲁跟踪，捕捉或孵化他并和他做朋友",
            "Examine the crystalline cocoon Butler gave you while at the Mt. Chimney Crater.": "前往烟囱山火山口检查巴特勒给你的水晶茧",
            "Butler has followed you to the Mt. Chimney Crater and is trying to kidnap Jirachi!": "巴特勒跟踪你到了烟囱山火山口并试图绑架基拉祈",
            "Butler has escaped through the Jagged Pass and hooked Jirachi up to some sort of machine. Fight him to free Jirachi.": "巴特勒从凹凸山道逃了出来，把基拉祈抓到某种机器上。将他击败以解救基拉祈",
            "Butler's attempts to resurrect Groudon have gone terribly wrong! Fight the resulting abomination!": "巴特勒复活固拉多的行动出现了差错！进入战斗以对抗由此产生的可憎之物",
            "Jirachi has escaped in the chaos and is roaming Hoenn. Catch Jirachi.": "基拉祈从混乱中逃了出来，在丰缘地区漫游，捕捉基拉祈"
        }
    },
    "A Meta Discovery": {
        "name": "发现怪物",
        "description": {
            "Help Butler's wish come true, responsibly.": "帮助巴特勒实现愿望."
        },
        "descriptions": {
            "Talk to Butler in the Jagged Pass to learn about his new plan.": "前往凹凸山道了解巴特勒的新计划",
            "Gather the materials Butler needs to rebuild his resurrection machine.": "收集巴特勒重建复活机器所需的材料",
            "Catch or hatch 100 Electrode": "捕捉或孵化100只顽皮雷弹",
            "Collect all buried treasure 25 times in the Underground mines.": "在地下矿场挖掘全部矿藏25次",
            "Capture or hatch 3 shiny Pokémon.": "捕捉或孵化3只闪光宝可梦",
            "Calibrate the machine by catching or hatching 5 Groudon": "捕捉或孵化5只固拉多来校准机器",
            "Deliver the materials to Butler in Mt. Chimney Crater and start the resurrection machine.": "前往烟囱山火山口把材料交给巴特勒，启动复活机器",
            "Butler has revived Meta Groudon at Mt. Chimney Crater. Catch Meta Groudon.": "巴特勒在烟囱山火山口复活了怪物固拉多。捕捉怪物固拉多"
        }
    },
    "Shadows in the Desert": {
        "name": "沙中之影",
        "description": {
            "Explore Orre and uncover the origin of Shadow Pokémon.": "探索欧雷地区并揭开暗影宝可梦的起源"
        },
        "descriptions": {
            "Travel to Orre and explore the Outskirt Stand.": "前往欧雷地区并探索郊外站",
            "Fight Willie": "打败威利",
            "Fight Folly the Shady Guy in Phenac City": "在矽铍市打败可疑男子赫波伊",
            "Check what is in the mysterious sack.": "检查神秘袋子里有什么",
            "Defeat 10 trainers who are using Shadow Pokémon in Phenac City.": "在矽铍市打败10名用暗影宝可梦的训练家",
            "Talk to the Mayor of Phenac City about the criminals you have been fighting.": "和矽铍市的市长讨论下关于你一直在打击的犯罪",
            "Meet up with Rui again in Phenac City.": "在矽铍市与米蕾再次见面",
            "Fight trainers in Pyrite Town to flush out the criminals.": "为了驱逐罪犯，打败在黄铁镇的训练家",
            "Talk to the distraught bodybuilder Duking in Pyrite Town.": "和黄铁镇的悲痛欲绝的健美运动员银马对话",
            "Fight trainers in Pyrite Colosseum to flush out the criminals.": "为了驱逐罪犯，打败在黄铁竞技场的训练家",
            "No sign of Shadow Pokémon so far. Fight trainers at the Pyrite Building to flush out the criminals.": "目前依旧没有暗影宝可梦的迹象。为了驱逐罪犯，打败在黄铁大楼的训练家",
            "Interrogate Hunter Doken in the Pyrite Building to find out who has taken Plusle, and where to.": "审问黄铁大楼的猎人多肯，找出谁带走了正电拍拍，以及去了哪里",
            "Find Miror B. and rescue Duking's Plusle in Pyrite Cave!": "找到迪斯裘，并解救黄铁洞窟中银马的正电拍拍",
            "Free Duking's Plusle.": "释放银马的正电拍拍",
            "Discuss your next move with Rui at Pyrite Colosseum.": "前往黄铁竞技场与米蕾讨论下一步行动",
            "Defeat the Team Cipher Peons looting Agate Village.": "击败正在掠夺玛瑙村的暗影干部们",
            "Rui is worried her grandpa is in trouble. Search for him by clearing Relic Cave.": "米蕾担心爷爷是不是碰上麻烦了，清理遗迹洞窟来找到他",
            "Find out more about Relic Cave from Grandpa Eagun.": "从罗根爷爷那里了解更多关于遗迹洞窟的信息",
            "There's rumors of more Team Cipher activity at Mt. Battle. Go investigate!": "有传言说暗影队要在对战山进一步活动，去调查一下吧！",
            "Discuss your next move with Rui at Mt. Battle.": "前往对战山与米蕾讨论下一步行动",
            "Track down the TV broadcast coming from The Under in Pyrite Town. Clear The Under.": "前往黄铁镇追查即将播出的电视节目《黄铁镇地下城》，并清理地下城",
            "Search Venus' Studio in the Under for clues.": "前往地下城的维纳斯演播室寻找线索",
            "Follow the secret tunnel to the Cipher Lab and clear out the enemies.": "沿着秘密隧道进入暗影研究所，清除敌人",
            "Team Cipher has taken over Realgam Tower! Fight to kick them out!": "暗影队占领了雄黄塔！把他们赶出去！",
            "From the top of Realgam Tower, you see Mayor Es Cade. Go ask him for help.": "从雄黄塔塔顶，你可以看到市长巴克雷。去找他帮忙吧",
            "Team Cipher's leaders have holed up in the Realgam Colosseum. Fight them to end this once and for all!": "暗影队的首领躲在雄黄竞技场里。打败他们，彻底终结这一切！",
            "Just when you have him cornered, Evice calls in a helicopter. Watch him escape the Realgam Colosseum.": "就在你把他逼入绝境的时候，厄犽呼叫了直升机。只能看着他逃出雄黄竞技场"
        }
    },
    "A New World": {
        "name": "新世界",
        "description": {
            "End Team Galactic's plan to destroy the world and create a new one in its place.": "终结银河队摧毁世界并在其位置上创造一个新世界的计划."
        },
        "descriptions": {
            "Team Galactic is stealing energy. Clear Valley Windworks.": "银河队正在窃取能量，请清理山谷发电厂",
            "Team Galactic is kidnapping Pokémon now. Clear Team Galactic Eterna Building in Eterna City.": "银河团队正在绑架宝可梦，前往在百代市清理银河百代大楼",
            "All is quiet. Team Galactic isn't doing anything. Maybe they learned their lesson. Just keep traveling, I guess. Clear the Pastoria City Gym.": "一切都很安静，银河队什么都没做。也许他们吸取了教训，继续旅行吧。击败野原市道馆",
            "The boss of Team Galactic has been spotted in Celestic Town!": "银河队首领出现在神和镇",
            "Cyrus is gone. Nothing to do but proceed. Adventure awaits! Clear the Canalave City Gym.": "赤日已经离开，无事可做，只能继续前进，冒险继续！击败水脉市道馆",
            "A commotion was heard at Lake Valor. You must protect the lake's guardian! Clear Lake Valor.": "立志湖传来一阵骚动，务必保护好湖的守护者！立即清理立志湖",
            "Lake Valor's guardian was taken. Better try again at the next lake. Clear Lake Verity.": "立志湖的守护者被抓走了，前往另一个湖中寻找，清理心齐湖",
            "Lake Verity's guardian was also taken. Only one lake remains. Clear Lake Acuity.": "心齐湖的守护者也被带走了，现在只剩下一个湖了。清理睿智湖",
            "You failed to protect any of the lake guardians. They have been taken to Veilstone City. So that's what that strange building was... Clear Team Galactic HQ in Veilstone City.": "你没能保护好湖里的守护者，它们被带到帷幕市。所以，这就是那个奇怪的建筑……清理银河队基地",
            "The lake guardians have been rescued, but Cyrus has used them to forge the Red Chain. He is taking it to the top of Mount Coronet. Follow him! Clear Spear Pillar.": "湖中守护者得救了，但赤日利用它们铸造了红色锁链，他要把红色锁链带到天冠山。跟着他！清理枪之柱",
            "Cyrus planned to use the Red Chain to enslave Dialga and Palkia, but he accidentally angered Giratina and has been taken to its realm. A portal has appeared on top of Mount Coronet. Use it to follow Cyrus and end his threat once and for all. Clear Distortion World.": "赤日计划用红色锁链控制帝牙卢卡和帕路奇亚，但他不小心激怒了骑拉帝纳，并被带到它的领域。一个传送门出现在天冠山上。用它追踪赤日，彻底消除威胁。清理毁坏的世界"
        }
    },
    "Recover the Precious Egg!": {
        "name": "找回珍贵的蛋!",
        "description": {
            "A rare egg is at the Sandgem Lab! Surely it should be easy to hatch one little egg, right?": "一颗罕见的蛋在真砂镇实验室！孵化一个小蛋当然很容易，对吧?"
        },
        "descriptions": {
            "Speak to Professor Hastings in Sandgem Town.": "前往真砂镇与新原教授谈谈",
            "Search for clues in Eterna Forest.": "前往百代森林寻找线索",
            "Catch or hatch 50 Water-type Pokémon, and see if those boulders are really just boulders.": "捕捉或孵化50只水属性宝可梦，看看这些巨石是否真的只是巨石",
            "Time to give those mysterious boulders the soaking of their life! Return to the Eterna Forest, and prepare for a battle.": "是时候浸泡这些神秘的巨石！回到百代森林，准备战斗",
            "Speak to the Go-Rock Commander in the Eterna Forest.": "前往百代森林与冲冲队干部谈谈",
            "Chase the fleeing Go-Rock Squad through the Eterna Forest!": "追逐逃离的冲冲队，穿过百代森林！",
            "Keep chasing the Go-Rock Squad through the Eterna Forest, but... didn't they already pass that tree?": "继续在百代森林中追赶冲冲队，但是……他们不是已经经过那棵树了吗？",
            "The Go-Rock Squad are definitely going in circles, but they're too dumb to realise it. Interrogate one on their method of navigating the Eterna Forest!": "冲冲队绝对是在兜圈子，他们太笨了，没有意识到这一点。查询一个人在百代森林的导航方法！",
            "They're using Parasect to navigate the Eterna Forest. Clear out a Parasect and they should get trapped!": "他们使用派拉斯特在百代森林中进行导航。击败一个派拉斯特，他们应该会被困住！",
            "Now you've muddied the path, continue the Eterna Forest chase!": "你把路弄脏了，继续百代森林的追逐",
            "You've cornered the Go-Rock Commander outside the Old Chateau! Time to finish this.": "你在森之洋馆外把冲冲队干部逼入了绝境！是时候结束这一切了",
            "Return the egg to Professor Hastings in Sandgem Town. ": "把蛋还给真砂镇的新原教授",
            "Professor Hastings has headed off to Canalave to do more research on Manaphy. Check in on him when you can!": "新原教授前往水脉市做关于玛纳霏的研究，有空就去看看他吧",
            "A little girl's Happiny stole the egg! Search for witnesses east of Canalave!": "一个小女孩的小福蛋偷窃了蛋！在水脉市东部寻找目击者！",
            "The Happiny headed north out of Jubilife! Ask for witnesses in the next town.": "小福蛋向北朝着祝庆市前进！与下一个城市的目击者谈谈",
            "The Happiny went north, through the Eterna Forest. Ask if anyone's seen it in Eterna City.": "小福蛋向北前进，穿过百代森林。问问有没有人在百代市见过他",
            "Search for someone who's seen the Happiny Egg-napper! It was last seen heading east across Route 211.": "找到一个目击小福蛋偷蛋的人！最后一次被看到是在２１１号道路上向东前进",
            "Keep asking around and following the Happiny Egg-thief! It was heading south, towards Solaceon Town.": "继续到处打听，追踪偷蛋者小福蛋，他往南朝着随意镇前进",
            "Hopefully you can finally catch up to this Happiny at Hearthome City. Ask around for any witnesses.": "希望你在家缘市能赶上小福蛋，问问周围有没有目击者",
            "The Happiny went through Mt. Coronet again? This time it went west through the Southern path. Ask around for witnesses on the other side.": "小福蛋再次经过天冠山？这次他通过南方路径向西前进。问问那边有没有目击者",
            "The Happiny fled from Oreburgh and headed west, through the Oreburgh Gate. Search for another witness on the far side.": "小福蛋逃离黑金市后，向西前进，穿过黑金闸口，前往黑金闸口另一边寻找目击者",
            "Search for evidence of the Happiny's path after turning south from Jubilife City.": "从祝庆市向南转弯后寻找小福蛋前进的轨迹",
            "An ex-Go-Rock in Sandgem Town has turned to Pokémon Pinching, and wants to steal the egg first. But after all you've been through to get it, he's in for a rude awakening": "真砂镇的冲冲队成员已经开始进行宝可梦偷窃计划，想先偷蛋。但经历了这么多之后，他猛然醒悟",
            "After leaving Sandgem, the Happiny went south-east, across the water. There's only one place it could be now...": "离开真砂镇后，小福蛋向东南方向前进，穿过水面。现在它只可能在一个地方...",
            "Oh no, you're not gonna let more boulders stop you now. Catch or hatch 50 Fighting-types and smash right through them.": "哦，不，你不会再让更多的巨石阻止你了。捕捉或孵化50只格斗属性宝可梦，粉碎这些巨石",
            "Time to head back to Pal Park and teach this little pink snot not to steal important eggs!": "是时候回伙伴公园，去教粉红小鼻涕虫别偷重要的蛋了",
            "The egg hatched after your battle with the egg-nappers! Bring Manaphy back to Hastings in Canalave City, and close off this mission for good.": "你和偷蛋者战斗后，蛋孵出来了！把玛纳霏带给水脉市的新原教授，永远结束这次任务"
        }
    },
    "Zero's Ambition": {
        "name": "杰洛的野心",
        "description": {
            "Help Zero find an entrance to the Distortion World.": "帮助杰洛找到通往毁坏的世界入口"
        },
        "descriptions": {
            "Talk to Zero in the Fight Area.": "前往战斗区与杰洛谈谈",
            "Read the recently discovered book in Canalave City.": "前往水脉市阅读最近在发现的书",
            "Report to Zero what was in the book.": "向杰洛报告书里的内容",
            "At Lake Verity, ask Mesprit about the Distortion World.": "前往心齐湖向艾姆利多询问关于毁坏的世界的情况",
            "Obtain 10 Purple Shards.": "获得10个Purple Shards",
            "At Lake Valor, ask Azelf about the Distortion World.": "前往立志湖向亚克诺姆询问关于毁坏的世界的情况",
            "Obtain 10 Ochre Shards.": "获得10个Ochre Shards",
            "At Lake Acuity, ask Uxie about the Distortion World.": "前往睿智湖向由克希询问关于毁坏的世界的情况",
            "Obtain 10 Crimson Shards.": "获得10个Crimson Shards",
            "Clear Sendoff Spring to meet the Lake Trio.": "通关送行之泉以见到湖之三神",
            "Talk to the Lake Trio in Sendoff Spring.": "在送行之泉与湖之三神谈谈",
            "Charge the key to the Distortion World.": "为毁坏的世界的钥匙充电",
            "Gain 500 Ghost gems.": "获得500个Ghost gems",
            "Gain 1 Spooky Plate.": "获得1个Spooky Plate",
            "Talk to Zero in Sendoff Spring.": "前往送行之泉与杰洛谈谈",
            "Defeat Zero to protect the key.": "努力保护钥匙，将击败杰洛吧",
            "Catch the ruler of the Distortion World.": "捕捉毁坏的世界的统治者"
        }
    },
    "Hollow Truth and Ideals": {
        "name": "空洞的真理与理想",
        "description": {
            "Prevent Team Plasma from using these dangerous Splicers.": "阻止等离子队使用这些危险的基因之楔"
        },
        "descriptions": {
            "A Team Plasma Grunt in Virbank City would like to steal your Pokémon. Defeat the grunt.": "立涌市的等离子队手下想偷走你的宝可梦，必须将他击败",
            "Some Team Plasma Grunts were seen entering the Castelia Sewers. Clear Castelia Sewers.": "有人看到等离子队进入了飞云下水道，清理飞云下水道",
            "Investigate the Perfectly Ordinary Frigate.": "调查非常普通的驱逐舰",
            "Seems there's nothing suspicious going on in Castelia City. Time to continue your journey. Clear the Nimbasa Gym.": "飞云市好像没什么可疑的事，是时候继续你的旅程了，击败雷文市道馆",
            "Hugh thinks some Team Plasma Grunts in Nimbasa City are stealing Pokémon. Defeat the grunts.": "阿修认为一些在雷文市的等离子队手下们正在偷窃宝可梦，击败他们",
            "They are definitely stealing Pokémon. Investigate the Totally Unsuspicious Frigate.": "他们绝对是在偷猎宝可梦，前往完全不可疑的驱逐舰进行调查",
            "Defeat the Team Plasma Grunts on the Totally Unsuspicious Frigate.": "在完全不可疑的驱逐舰上击败等离子队手下们",
            "Talk to Zinzolin.": "与维奥谈谈",
            "The Frigate is gone. Nothing to do but move forward. Clear route 13.": "驱逐舰已经离开，除了向前走什么都不做。清理１３号道路",
            "You have stumbled upon Zinzolin and a Team Plasma Grunt in Lacunosa Town. Defeat the grunt.": "你在笼目镇偶然发现了维奥和等离子队手下，击败他们",
            "Defeat Zinzolin.": "击败维奥",
            "Defeat the Opelucid City gym leader to obtain the DNA Splicers before Team Plasma does!": "击败双龙市道馆的馆主，在等离子队之前获得基因之楔！",
            "Team Plasma has stolen the DNA Splicers and is assaulting the city with an army of grunts and shadows! Defend against the Team Plasma Assault!": "等离子队偷走了基因之楔，他们正进攻城市！抵御等离子队的攻击",
            "Defeat the Plasma Shadow.": "击败等离子黑暗",
            "Team Plasma has fled the scene with the stolen DNA Splicers. Find and clear out the Plasma Frigate.": "等离子队带着偷来的基因之楔逃离了现场，找到并清除等离子驱逐舰",
            "Team Plasma's leader Ghetsis plans on using the DNA Splicers on Kyurem in Giant Chasm. Clear the dungeon to end his evil plans.": "等离子队队长魁奇思计划在巨人洞窟的酋雷姆身上使用基因之楔。清理地牢，结束他的邪恶计划",
            "Talk to Colress on the Plasma Frigate.": "登上等离子驱逐舰与阿克罗玛交谈",
            "Defeat Colress.": "击败阿克罗玛",
            "Defeat the Plasma Shadows.": "击败等离子黑暗们",
            "Talk to the Shadow Triad.": "与黑暗铁三角谈谈",
            "Ghetsis has done something to the legendary Dragon-type Pokémon inside Giant Chasm!": "魁奇思对巨人洞窟里的传说中的龙属性宝可梦做了什么！",
            "Defeat Ghetsis one final time!": "最后一次击败魁奇思"
        }
    },
    "Destiny Deoxys": {
        "name": "裂空的访问者 代欧奇希斯",
        "description": {
            "Discover the mystery of the crashed meteor.": "调查坠落陨石之谜"
        },
        "descriptions": {
            "There seems to be a big fuss about a new discovery in the Giant Chasm. Try finding it.": "巨人洞窟似乎因某项新发现而闹得沸沸扬扬。去找找看",
            "You found a pulsating Green Gemstone. Take a closer look.": "你发现了一枚会脉动的绿水晶。仔细查看",
            "Rayquaza and Deoxys are rampaging in the area. Try to calm them down.": "烈空坐和代欧奇希斯正在附近肆虐。想办法让它们冷静下来",
            "Now that the situation has calmed down talk to the local scientists about the Green Gemstone.": "现在事态已平息，与当地的研究员谈谈那枚绿水晶",
            "Check out the Battle Frontier while the scientist analyzes the gemstone.": "研究员正在分析那枚水晶，去逛逛对战开拓区",
            "While you were in the Battle Frontier an army of Deoxys attacked. Fight your way out!": "你在对战开拓区时，一支代欧奇希斯军队发动了袭击。一路战斗突围！",
            "The scientist you met at Giant Chasm is looking for you at the Battle Frontier.": "在巨人洞窟遇到的那位研究员正在对战开拓区找你",
            "The generator isn't working. Look around for scraps to repair it.": "发电机无法运作。四处寻找材料进行修理",
            "Gain 15,000 Electric gems.": "获得15,000个电之宝石",
            "Gain 5,000 Steel gems.": "获得5,000个钢之宝石",
            "Rayquaza attacks again. Calm it down for the last time.": "烈空坐再次发动攻击。最后一次让它冷静下来",
            "Rayquaza realized that the Deoxys are no threat. Reunite the Purple and Green Gemmed Deoxys.": "烈空坐意识到代欧奇希斯并非威胁。让紫水晶与绿水晶代欧奇希斯重聚"
        }
    },
    "Swords of Justice": {
        "name": "圣剑士",
        "description": {
            "The Swords of Justice sense something bad is about to happen, will you be able to help them out?": "圣剑士预感到一些不好的事情即将发生，你能帮助他们吗？"
        },
        "descriptions": {
            "Talk to the Old Man in Mistralton Cave for clues on where the Swords of Justice are.": "前往吹寄洞穴与老人交谈，寻找圣剑士的线索",
            "Search around Mistralton Cave to see if you can find Cobalion, as the Old Man said.": "按照老人的说法，在吹寄洞穴周围搜索，看看能否找到勾帕路翁",
            "It looks like you've found Cobalion! Talk to them.": "看起来你找到了勾帕路翁！上前与他们交谈吧",
            "Start reuniting the Swords of Justice once again. You should probably start looking for Terrakion around Unova's Victory Road.": "重新集结圣剑士。你应该开始在合众地区的冠军之路附近寻找代拉基翁",
            "You've found Terrakion! Talk to them about the reunion.": "你找到了代拉基翁！与他们讨论集结的事",
            "Defeat Terrakion to prove you're worthy of their trust.": "击败代拉基翁以证明你值得他们的信任",
            "Talk to Cobalion at the Moor of Icirrus to learn where to find Virizion.": "前往雪花湿地与勾帕路翁交谈，了解如何找到毕力吉翁",
            "Now that you know where to find Virizion, search for them in Pinwheel Forest.": "现在你知道在哪里可以找到毕力吉翁，前往矢车森林中搜索他们",
            "Now that you've found Virizion, tell them to meet the others at the Moor of Icirrus.": "现在你已经找到毕力吉翁，告诉他们在雪花湿地与其他人会面",
            "Virizion is asking you to gather 5,000 Grass Gems to prove you're a trustworthy ally. Collect the gems and return to Pinwheel Forest to prove your worth.": "毕力吉翁要求你收集5,000个草之宝石以证明你是一个值得信赖的盟友。收集宝石并返回矢车森林证明你的价值",
            "Now that you've gathered all of the Grass Gems, talk to Virizion in Pinwheel Forest once again.": "现在你已经收集了所有草之宝石，再次前往矢车森林与毕力吉翁交谈",
            "Meet up with the Swords of Justice at Moor of Icirrus and talk to Cobalion.": "在雪花湿地与圣剑士会面，并与勾帕路翁交谈",
            "They need you to prove you're strong enough to deal with the possible dangers. Defeat the Swords of Justice!": "他们需要你证明自己足够强大，能够应对可能的危险。击败圣剑士！",
            "Now that you've proven you're strong enough to help, take Cobalion's advice and search for Kyurem in the Giant Chasm.": "现在你已证明自己足够强大可以帮助他们，听取勾帕路翁的建议，在巨人洞窟中寻找酋雷姆",
            "Report your findings to Cobalion at the Moor of Icirrus.": "在雪花湿地向勾帕路翁报告你的发现",
            "Looks like Cobalion has seen Kyurem near Lacunosa Town. Go there and defeat Kyurem before it hurts any citizens.": "看起来勾帕路翁在笼目镇附近看到了酋雷姆。前往那里，在它伤害市民之前击败酋雷姆",
            "Seems like Kyurem has fled the town. You should talk to Cobalion while you're there.": "看起来酋雷姆已经逃离了镇上。你在那里时应该与勾帕路翁交谈",
            "Kyurem is probably hiding in the Giant Chasm. Find its lair.": "酋雷姆可能藏在巨人洞窟中。找到它的巢穴",
            "You've finally found Kyurem! Defeat it with the help of the Swords of Justice.": "你终于找到酋雷姆了！在圣剑士的帮助下击败它",
            "Kyurem has injured the Swords of Justice, go check on Cobalion.": "酋雷姆伤害了圣剑士，去看看勾帕路翁的情况",
            "Defeat Kyurem and stop it from causing any more harm!": "击败酋雷姆，阻止它造成更多伤害！",
            "You've finally defeated Kyurem, sealing it within the Giant Chasm forever. Talk to the Swords of Justice in the Giant Chasm.": "你终于击败了酋雷姆，将其永远封印在巨人洞窟内。在巨人洞窟与圣剑士交谈",
            "Talk to Cobalion.": "与勾帕路翁交谈",
            "Talk to Terrakion.": "与代拉基翁交谈",
            "Talk to Virizion.": "与毕力吉翁交谈",
            "The Swords of Justice all depart for their homes to wait for your arrival. Go catch your new friends and add them to your team!": "圣剑士全部返回各自的家中等待你的到来。去抓捕你的新朋友，并将他们加入你的队伍！",
            "Capture the Leader of the Swords of Justice, Cobalion, in Mistralton Cave.": "前往吹寄洞穴捕捉圣剑士的领袖勾帕路翁",
            "Capture the Toughest of the Swords of Justice, Terrakion, in Victory Road.": "在冠军之路捕捉圣剑士中最坚韧的代拉基翁",
            "Capture the Cleverest of the Swords of Justice, Virizion, in Pinwheel Forest.": "在矢车森林捕捉圣剑士中最聪明的毕力吉翁"
        }
    },
    "The Legend Awakened": {
        "name": "超梦觉醒",
        "description": {
            "Learn about the powerful Pokémon discovered under the P2 Laboratory.": "了解Ｐ２实验室发现的强大神奇宝贝"
        },
        "descriptions": {
            "Investigate the basement of the P2 Laboratory.": "前往Ｐ２实验室 的地下室进行调查",
            "Fight the mysterious Pokémon in the Castelia Sewers.": "前往飞云下水道，与神秘的宝可梦进行战斗",
            "Search the Castelia Sewers for clues about the Red Genesect.": "前往飞云下水道里搜寻红色盖诺赛克特的线索",
            "Talk to the Ancient Bug Hunter in the Castelia Sewers.": "前往飞云下水道和古代虫子猎人交谈",
            "Defeat the four Genesect surrounding Castelia City.": "击败包围飞云市的四个盖诺赛克特",
            "The Red Genesect is trying to escape the Castelia Sewers, stop it!": "红色盖诺赛克特正试图逃离飞云下水道，快阻止它！",
            "Witness the battle between the Red Genesect and another powerful Pokémon in Castelia City.": "在飞云市城见证红色盖诺赛克特和另一个强大的宝可梦战斗",
            "The Red Genesect has crashed into the P2 Lab and escaped underground. Start digging to learn more.": "红色盖诺赛克特闯进Ｐ２实验室 ，逃到了地下矿场。请开始挖掘，并找到它",
            "Catch Genesect in P2 Lab.": "前往Ｐ２实验室 抓捕盖诺赛克特"
        }
    },
    "Gale of Darkness": {
        "name": "暗之旋风",
        "description": {
            "Team Cipher has returned to Orre. Stop their new evil plan!": "暗影队已返回欧雷地区。阻止他们新的邪恶计划！"
        },
        "descriptions": {
            "Ask around Gateon Port for clues about new Team Cipher activity.": "前往堇青港询问关于新的暗影队活动的线索",
            "Fight the Cipher Peons attacking the Pokémon HQ Lab.": "前往宝可梦综合研究所与暗影干部们对战",
            "Clear Gateon Port to search for the Cipher Peons who kidnapped Professor Krane.": "清理堇青港，寻找绑架暮阴博士的暗影干部们",
            "Talk to Chobin at Kaminko's Manor, if he's willing to talk.": "前往姜荷博士的房子找乔宾谈谈，如果他愿意的话",
            "Talk to Chobin at Kaminko's Manor.": "前往姜荷博士的房子找乔宾谈谈",
            "Talk to Grandpa Eagun at the Relic Stone.": "前往神圣森林的祠堂与罗根爷爷谈谈",
            "Clear Mount Battle and see if anyone there has a lead on the source of Shadow Pokémon.": "清理对战山，看看有没有人知道暗影宝可梦的来源",
            "Track down the new boss of the Cipher Lab.": "寻找暗影研究所的新首领",
            "Talk to Cipher Admin Lovrina at the Cipher Lab.": "前往暗影研究所与暗影干部爱丽娜谈谈",
            "Pyrite Town is in chaos! Battle your way through to get some answers.": "黄铁镇一片混乱！ 奋力闯关以获得一些答案",
            "Find and defeat Miror B. near a cool cave.": "在一个凉爽的洞穴附近，找到并击败迪斯裘",
            "Track down the new boss of the Pyrite Building.": "前往黄铁大楼寻找新的首领",
            "Talk to Cipher Commander Exol at the Pyrite Building.": "前往黄铁大楼和暗影战斗队长达卡查谈话",
            "Battle through the new Cipher Peons in Phenac City.": "前往矽铍市，与新的暗影干部们对战",
            "Track down the new boss of the Phenac Stadium.": "找前往矽铍竞技场寻找新首领",
            "Talk to Cipher Admin Snattle at the Phenac Stadium.": "和矽铍竞技场的暗影干部瓦资尔谈谈",
            "Talk to Mayor Trest at the Phenac City.": "前往矽铍市，与市长达格德谈谈",
            "Talk to the wealthy Mr. Verich at Gateon Port to learn more about the S. S. Libra.": "前往堇青港与富有的死金谈谈，了解更多关于天秤座号的情况",
            "Fight the Cipher Peon at the wreck of the S. S. Libra.": "在天秤座号的残骸上与暗影干部对战",
            "Search the S. S. Libra for clues.": "在天秤座号上寻找线索",
            "Fight Zook outside of the Cipher Key Lair.": "在暗影秘密工厂外和扎酷斯加战斗",
            "Miror B. has surfaced again! Fight him at the Outskirt Stand.": "迪斯裘又出现了！前往郊外站和他对战",
            "Battle through the Snagem Hideout and look for clues.": "前往夺取队基地进行对战并寻找线索",
            "You found a key to the Cipher Key Lair. Find out what's inside!": "你找到了暗影秘密工厂的钥匙。看看里面是什么！",
            "Talk to Professor Krane at the Pokémon HQ Lab.": "前往宝可梦综合研究所与暮阴博士谈谈",
            "Battle through Team Cipher on Citadark Isle": "前往镍暗岛与暗影队战斗",
            "Defeat Grand Master Greevil and XD001 in the Citadark Isle Dome.": "前往镍暗岛巨蛋击败暗影总帅死金和黑暗洛奇亚（XD001）"
        }
    },
    "The Delta Episode": {
        "name": "EpisodeΔ",
        "description": {
            "A catastrophe is on the horizon! Work with the people of Hoenn to stop it.": "一场灾难即将来临！与丰缘众人合作阻止它"
        },
        "descriptions": {
            "Talk to Dr. Cozmo in Fallarbor Town.": "与秋叶镇的索蓝斯博士交谈",
            "Talk to the mysterious figure at the Sky Pillar.": "与天空之柱的神秘人物交谈",
            "Travel with Zinnia to Littleroot Town and talk to May.": "与希嘉娜一起前往未白镇并与小遥交谈",
            "Discuss the news with Professor Birch in Littleroot Town.": "与未白镇的小田卷博士讨论消息",
            "Find out why May is so mad in Littleroot Town.": "找出小遥在未白镇如此疯狂的原因",
            "Follow Zinnia to Petalburg City.": "跟随希嘉娜前往橙华市",
            "Defeat Courtney": "击败火雁",
            "Defeat Matt": "击败阿潮",
            "Talk to Wally and answer your ringing Holo Caster in Petalburg City.": "在橙华市通过全息影像通讯器交谈并回复满充",
            "Answer your ringing Holo Caster.": "打开全息影像通讯器接听电话",
            "Talk to Wally.": "与满充谈谈",
            "Search Granite Cave and look for Star Pieces.": "搜索石之洞窟并寻找 Star Pieces",
            "Clear Granite Cave 10 times.": "清理石之洞窟10次",
            "Find a Star Piece.": "寻找1个星星碎片",
            "Talk to Zinnia in Granite Cave.": "与石之洞窟的希嘉娜交谈",
            "Defeat Zinnia in Granite Cave": "在石之洞窟击败希嘉娜",
            "Talk to Dr. Cozmo at the Mossdeep Space Center.": "与绿岭宇宙中心的索蓝斯博士交谈",
            "Talk to Zinnia at the Mossdeep Space Center.": "与绿岭宇宙中心的希嘉娜交谈",
            "Clear Meteor Falls 10 times to search for the Meteor Shard.": "清理流星瀑布10次以搜索流星碎片",
            "Talk to the Draconid Elder in Meteor Falls.": "与流星瀑布的流星之民长老交谈",
            "Defeat the Draconid Elder in Meteor Falls.": "在流星瀑布击败流星之民长老",
            "Defeat the Team Aqua and Magma Grunts attacking the Mossdeep Space Center.": "击败攻击绿岭宇宙中心的海洋队和熔岩队",
            "Defeat the Aqua Grunt.": "击败海洋队手下",
            "Defeat the Magma Grunt.": "击败熔岩队手下",
            "Defeat the admins trying to take over the Mossdeep Space Center.": "击败试图接管绿岭宇宙中心的管理员",
            "Follow Zinnia to the Aqua hideout and search for her.": "跟随希嘉娜前往海洋队基地并寻找她",
            "Talk to Archie in the Team Aqua Hideout.": "在海洋队基地与水梧桐交谈",
            "Follow Zinnia to the Magma Hideout and search for her.": "跟随希嘉娜前往熔岩队基地并寻找她",
            "Talk to Maxie in the Team Magma Hideout.": "与熔岩队基地的赤焰松交谈",
            "Talk to Wallace in Sootopolis City.": "与琉璃市的米可利交谈",
            "Defeat Wallace in Sootopolis City.": "在琉璃市击败米可利",
            "Defeat Zinnia at the Sky Pillar.": "在天空之柱击败希嘉娜",
            "Capture or hatch Rayquaza.": "捕捉或孵化烈空坐",
            "Talk to Zinnia at the Sky Pillar.": "在天空之柱与希嘉娜交谈",
            "Mega Evolve Rayquaza.": "Mega进化烈空坐",
            "Fly Mega Rayquaza into space to destroy the Meteor.": "将Mega 烈空坐送入太空以摧毁流星"
        }
    },
    "Primal Reversion": {
        "name": "原始回归",
        "description": {
            "Teams Aqua and Magma have been trying to unlock the Primal power of Groudon and Kyogre.": "海洋队与熔岩队一直在试图解放固拉多和盖欧卡的原始力量"
        },
        "descriptions": {
            "Talk to Mr. Stone in Slateport City.": "前往凯那市与兹伏奇社长交谈",
            "Clear Granite Cave 10 times to search for the Primal Reversion Mural.": "为了寻找原始壁画，清理10次石之洞窟",
            "Examine the Primal Murals.": "检查原始壁画",
            "Examine the first Primal Mural in Granite Cave.": "前往石之洞窟检查第一幅原始壁画",
            "Examine the second Primal Mural in Granite Cave.": "前往石之洞窟检查第二幅原始壁画",
            "Talk to Steven in the Granite Cave to learn more about the Primal Murals.": "在石之洞窟与大吾交谈，了解更多关于原始壁画的信息",
            "Find Captain Stern at Sea Mauville during Thunderstorm Weather.": "在雷雨天气，前往海紫堇寻找楠木馆长",
            "Fight Captain Stern at Sea Mauville.": "在海紫堇打败楠木馆长",
            "Talk to Captain Stern at Sea Mauville about the mysteries of the sea.": "前往海紫堇与楠木馆长探讨海洋的奥秘",
            "Obtain the items Captain Stern needs to upgrade the Submarine.": "为了升级潜艇，获取楠木馆长所需的物品",
            "Find 10 Metal Coats.": "寻找10个金属膜",
            "Find one Mystic Water.": "寻找1个神秘水滴",
            "Find 3 Heat Rocks.": "寻找3个炽热岩石",
            "Talk to Captain Stern at Sea Mauville and upgrade the submarine.": "前往海紫堇与楠木馆长谈谈，并升级潜艇",
            "Clear the Seafloor Cavern 10 times to learn more about the mysterious occurrences.": "清理10次海底洞窟，了解更多神秘事件",
            "Defeat the Team Aqua and Team Magma leaders in the Seafloor Cavern.": "在海底洞窟击败海洋队与熔岩队首领",
            "Defeat Archie": "击败水梧桐",
            "Defeat Maxie": "击败赤焰松",
            "Clear the Weather Institute 10 times to search for clues about Archie and Maxie's plans.": "为了寻找水梧桐和赤焰松计划的线索，清理10次天气研究所",
            "Scan the area for unusual weather at the Weather Institute.": "前往天气研究所，查询该地区的异常天气",
            "Investigate Mt. Pyre for the source of the disturbances.": "调查一下送神山，寻找干扰的来源",
            "Find out what the Team Leaders are up to at Mt. Pyre.": "找出团队首领在送神山的做了什么",
            "Talk to Archie.": "与水梧桐谈谈",
            "Talk to Maxie.": "与赤焰松谈谈",
            "Defeat the Primal Reversions. Predict their rampage by monitoring the weather at the Weather Institute.": "击败两只原始回归宝可梦。通过在天气研究所监测天气来预测他们的行动",
            "Defeat Primal Groudon in Harsh Sunlight Weather.": "在强烈的阳光天中击败原始固拉多",
            "Defeat Primal Kyogre in Raining Weather.": "在雨天中击败原始盖欧卡"
        }
    },
    "Detective Pikachu": {
        "name": "名侦探皮卡丘",
        "description": {
            "Detective Pikachu's partner has gone missing, and he needs your help!": "名侦探皮卡丘的搭档失踪了，他需要你的帮助!"
        },
        "descriptions": {
            "Search Goldenrod City for clues.": "前往满金市寻找线索",
            "Defeat the Aipoms": "击败长尾怪手们",
            "The Aipoms dropped some sort of vial while they were running away. It looks like they were headed towards the Radio Tower. Find it!": "长尾怪手们逃跑时掉了一个小瓶，看起来他们朝满金电台去了，找到它！",
            "Detective Pikachu has an informant who knows more about the mysterious vial. Meet with him in Saffron City.": "侦探皮卡丘有个线人知道更多关于神秘试剂的情况。前往金黄市与他见面",
            "The informant is proving hard to convince. Time to get physical!": "事实证明告密者很难被说服。是时候锻炼身体了",
            "The informant is finally willing to \"talk\", find out what he has to say.": "告密者终于愿意“谈话”，看看他有什么要说的",
            "Infiltrate the underground fighting ring.": "潜入地下战斗圈",
            "Go to Clifford Industries in Goldenrod City to demand some answers.": "前往满金市向克利福德工业要个答案",
            "Meet up with investigative journalist Lucy Stevens in Hearthome City": "在家缘市与调查记者露西·史蒂文斯会面",
            "Search the research laboratory for clues.": "在实验室里寻找线索",
            "It was an ambush! You have been followed to Nuvema Town, defeat the mysterious attackers and escape!": "这是个圈套！你追踪到鹿子镇，击败神秘的袭击者并逃脱",
            "Detective Pikachu is injured. He asks you to get help from his friend near Cerulean Cave": "侦探皮卡丘受伤了，他告诉你可以在华蓝洞窟附近的朋友那里得到帮助",
            "Confront Howard Clifford in Goldenrod City about his involvement with the R vials.": "去满金市面对霍华德·克利福德，了解他与R试剂的关系",
            "Defeat Howard's bodyguard and escape.": "击败霍华德的保镖并逃脱",
            "Give Howard Clifford one last chance to surrender!": "给霍华德·克利福德最后一次投降的机会！",
            "Defeat Mewtwo to free it from Howard's control!": "打败超梦，将它从霍华德的控制中解放出来",
            "Talk to Mewtwo near Cerulean Cave about Detective Pikachu's partner.": "和华蓝洞窟附近的超梦谈谈侦探皮卡丘的搭档",
            "Talk to Detective Raichu": "与侦探雷丘谈谈"
        }
    },
    "The Great Vivillon Hunt!": {
        "name": "狩猎伟大的彩粉蝶",
        "description": {
            "Discover the beauty of Vivillon.": "寻找美丽的彩粉蝶."
        },
        "descriptions": {
            "Capture or hatch 100 Water-type Pokémon.": "捕捉或孵化100只水属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It has been spotted at some Lakes.": "找到并捕捉罕见的彩粉蝶！\n提示：在一些湖泊发现了他",
            "Capture or hatch 100 Psychic-type Pokémon.": "捕捉或孵化100只超能力属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It's surrounded by strong Pokémon.": "找到并捕捉罕见的彩粉蝶！\n提示：他被强大的宝可梦包围着",
            "Capture or hatch 100 Poison-type Pokémon.": "捕捉或孵化100只毒属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It has been spotted in a swamp.": "找到并捕捉罕见的彩粉蝶！\n提示：有人在沼泽里发现了他",
            "Capture or hatch 100 Dark-type Pokémon.": "捕捉或孵化100只恶属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It's hiding at a dark place.": "找到并捕捉罕见的彩粉蝶！\n提示：他藏在一个黑暗的地方",
            "Capture or hatch 100 Steel-type Pokémon.": "捕捉或孵化100只钢属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It flew into a factory.": "找到并捕捉罕见的彩粉蝶！\n提示：他飞进了一家工厂",
            "Capture or hatch 100 Fire-type Pokémon.": "捕捉或孵化100只火属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It seems to like hot places.": "找到并捕捉罕见的彩粉蝶！\n提示：他似乎喜欢炎热的地方",
            "Capture or hatch 100 Fighting-type Pokémon.": "捕捉或孵化100只格斗属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It's sitting on a swaying pillar.": "找到并捕捉罕见的彩粉蝶！\n提示：他趴在一根摇摆的柱子上",
            "Capture or hatch 100 Ghost-type Pokémon.": "捕捉或孵化100只幽灵属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It's visiting an abandoned and spooky place.": "找到并捕捉罕见的彩粉蝶！\n提示：他在探访一个废弃而阴森的地方",
            "Capture or hatch 100 Fairy-type Pokémon.": "捕捉或孵化100只妖精属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It's flying around an overgrown place full of dreams.": "找到并捕捉罕见的彩粉蝶！\n提示：他在一个充满梦想且杂草丛生的地方飞翔",
            "Capture or hatch 100 Electric-type Pokémon.": "捕捉或孵化100只电属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It's currently in a City full of Electric-type Pokémon.": "找到并捕捉罕见的彩粉蝶！\n提示：他在一个充满电属性宝可梦的城市",
            "Capture or hatch 100 Bug-type Pokémon.": "捕捉或孵化100只虫属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It hides in a dark Forest.": "找到并捕捉罕见的彩粉蝶！\n提示：他藏在黑暗的森林里",
            "Capture or hatch 100 Flying-type Pokémon.": "捕捉或孵化100只飞行属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It's high up in the sky.": "找到并捕捉罕见的彩粉蝶！\n提示：他在高高的天空中",
            "Capture or hatch 100 Ground-type Pokémon.": "捕捉或孵化100只地面属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It got lost in the desert sand.": "找到并捕捉罕见的彩粉蝶！\n提示：他在沙漠里迷路了",
            "Capture or hatch 100 Grass-type Pokémon.": "捕捉或孵化100只草属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It only shows up amongst the most beautiful flowers.": "找到并捕捉罕见的彩粉蝶！\n提示：他只出现在最美的花中",
            "Capture or hatch 100 Rock-type Pokémon.": "捕捉或孵化100只岩石属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It has been spotted dancing in the moonlight.": "找到并捕捉罕见的彩粉蝶！\n提示：有人看见他在月光下跳舞",
            "Capture or hatch 100 Dragon-type Pokémon.": "捕捉或孵化100只龙属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It's surrounded by dragons.": "找到并捕捉罕见的彩粉蝶！\n提示：他被龙属性宝可梦包围着",
            "Capture or hatch 100 Ice-type Pokémon.": "捕捉或孵化100只冰属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: It can be found at a very cold place.": "找到并捕捉罕见的彩粉蝶！\n提示：你可以在非常寒冷的地方找到他",
            "Capture or hatch 200 Normal-type Pokémon.": "捕捉或孵化200只一般属性宝可梦",
            "Find and capture the rare Vivillon!\nHint: Only the strongest Challengers can reach it.": "找到并捕捉罕见的彩粉蝶！\n提示：只有最强的挑战者才能到达"
        }
    },
    "A Beautiful World": {
        "name": "一个美丽的世界",
        "description": {
            "End Team Flare's plan to destroy the world and create a new one in its place.": "终结闪焰队摧毁世界，创造一个新世界的计划"
        },
        "descriptions": {
            "Talk to Lysandre inside Professor Sycamore's lab in Lumiose City.": "前往密阿雷市的布拉塔诺宝可梦研究所与弗拉达利谈谈",
            "Well, that was definitely a weird guy... Seems like Calem wants to meet you somewhere in Lumiose City, go talk with him.": "嗯，那绝对是个奇怪的家伙。卡鲁穆在密阿雷市等你，去找他谈谈",
            "Meet Calem in Ambrette Town.": "前往古香镇与卡鲁穆见面",
            "Clear Glittering Cave and find the scientist.": "清理闪耀洞窟并找到研究员",
            "It seems that Team Flare Grunt is holding the scientist captive, free him!": "应该是闪焰队手下囚禁了研究员，解救他！",
            "From what you gathered, Team Flare wanted to sell fossils for money. Talk with the fossil scientist you just rescued in Glittering Cave.": "从你收集到的信息来看，闪焰队想要卖化石赚钱。与你刚刚从闪耀洞窟中救出的化石研究员交谈",
            "With interesting thoughts about Team Flare in your head, you decide to challenge the Cyllage City Gym to become stronger.": "对于闪焰队你有了些有趣的想法，所以你打算挑战遥香道馆去变得更强",
            "You can see in Geosenge Town the Team Flare Grunt you battled earlier. Approach him once more.": "在石香镇你可以看到之前战斗过的闪焰队手下，再次接近他",
            "Beat the Team Flare Grunt once more!": "再一次击败闪焰队手下",
            "You heard rumors of Diantha being in Coumarine City. Go there to check if you can see her.": "你听到了有关比翼市卡露妮的传闻。去那里看看能不能见到她",
            "Lysandre is calling you while you are standing in Coumarine City, pick up the phone.": "当你到达比翼市的时候弗拉达利会给你打电话，记得接电话",
            "Well, that was extremely awkward... But ignoring that, Lumiose City still hasn't fixed the power outage, go clear the Kalos Power Plant.": "这真是太尴尬了。不过不管它，密阿雷市已经处于停电状态，去清理卡洛斯发电站",
            "You've helped with the power outage problem, now the gym in Lumiose City is back up and you can challenge it!": "你解决了停电问题，密阿雷市道馆恢复了运营，你可以去挑战它了！",
            "Professor Sycamore wants to meet you in Lumiose City. He's with Lysandre, go say hi.": "布拉塔诺博士和弗拉达利在密阿雷市等你。去打个招呼吧",
            "For someone so obsessed with beauty he seems to really care about filth... Anyway, the Poké Ball Factory sounds like a fun place, let's go check it out.": "对于一个痴迷于美的人来说，他似乎真的很在乎污秽。不管怎样，精灵球工厂听起来是个有趣的地方，让我们去看看吧",
            "Now that Team Flare is not in the Poké Ball Factory anymore, talk with the Director that you just saved.": "现在闪焰队已经不在精灵球工厂了，与你刚刚救出的老板谈谈",
            "Professor Sycamore is waiting for you in Dendemille Town. He has some important things to say about the legendary Pokémon of Kalos.": "布拉塔诺博士在风絮镇等你。他有一些关于卡洛斯的传说宝可梦的事情要说",
            "You were going to Frost Cavern for Pokémon, but what you found there is Team Flare instead! Clear it!": "你原本想去冰结洞窟寻找宝可梦，结果却发现了闪焰队，清理洞窟！",
            "So everything is over now, right? Right? Go beat Anistar City Gym!": "所以什么事都结束了，对吧？去打败百刻道馆吧！",
            "Lysandre is giving an important speech through the TV News. Watch it in Anistar City.": "弗拉达利正在通过电视新闻发表重要讲话。前往百刻市观看",
            "Wow! Absolutely no one could have seen this coming! You think you might find Lysandre in Lumiose City where you first met him. Look for him!": "哇！绝对没有人能预见到这一点！你会在密阿雷市第一次见到弗拉达利的地方找到他。找他！",
            "Show Team Flare Lysandre the strength of your convictions in Lumiose City!": "在密阿雷市向闪焰队弗拉达利展示你那坚定的信念",
            "You run after Lysandre and while going through the Labs you find a jailed mysterious man in Lumiose City. It seems like he has a story to tell...": "你紧追弗拉达利，当你穿过实验室时，你在密阿雷市发现了一个被囚禁的神秘人。他好像有故事要讲",
            "Now that you learnt what the ultimate weapon is able to do, you need to stop it. Team Flare Xerosic is in the way in Lumiose City, defeat him!": "现在你了解到最终兵器能做些什么，你需要停下它。闪焰队库瑟洛斯奇就在密阿雷市，打败他！",
            "Xerosic offers you the possibility to stop the ultimate weapon in Lumiose City. Blue or Red Button, press one!": "库瑟洛斯奇向你提供了停下在密阿雷市的最终兵器的可能性。蓝色或红色按钮，选一个吧！",
            "Press the blue button!": "按下蓝色按钮！",
            "Press the red button!": "按下红色按钮！",
            "The ultimate weapon was activated in Geosenge Town! Go to the Team Flare Secret HQ to put a stop to it! First step: Beating Team Flare Aliana.": "最终兵器在石香镇被激活了！为了停下它前往闪焰队秘密基地！第一步：打败闪焰队阿可碧",
            "Continue traversing through the Team Flare Secret HQ! Second step: Beating Team Flare Celosia.": "继续深入闪焰队秘密基地！第二步：击败闪焰队克蕾儿",
            "You should be halfway through. Go further in the Team Flare Secret HQ! Third step: Beating Team Flare Bryony.": "你应该走了一半了，进一步深入闪焰队秘密基地！第三步：击败闪焰队芭菈",
            "You are getting close. Resume delving into the Team Flare Secret HQ! Fourth step: Beating Team Flare Mable.": "更接近了，继续深入闪焰队秘密基地！第四步：击败闪焰队茉蜜姬",
            "You are almost there! One more time traversing through the Team Flare Secret HQ and you'll get to the end! Fifth step: Beating Team Flare Lysandre.": "你几乎要到了！再一次深入闪焰队秘密基地然后你就能到达！第五步：击败闪焰队弗拉达利",
            "This is it, you've beaten Lysandre at the top of his game in Team Flare Secret HQ, right? He might have something else to say...": "就是这样，你在闪焰队秘密基地打败了弗拉达利，对吧？他可能还有其他的话想说",
            "You go to the lowest level of the Team Flare Secret HQ as Lysandre told you to. There you find Xerneas and Yveltal fighting each other! Fight them yourself and calm them down!": "你前往了弗拉达利告诉你的闪焰队秘密基地最底层，在哪里你发现了哲尔尼亚斯和伊裴尔塔尔正在互相对战！击败他们来让他们冷静下来！",
            "Calm Xerneas down!": "让哲尔尼亚斯冷静下来！",
            "Calm Yveltal down!": "让伊裴尔塔尔冷静下来！",
            "Lysandre appears menacingly in front of you in Team Flare Secret HQ. He doesn't seem fazed about you subsiding both legendary Pokémon.": "弗拉达利出现在闪焰队秘密基地中，他似乎并不担心你平息两个传说中的宝可梦",
            "Stop Team Flare Boss Lysandre in Team Flare Secret HQ once and for all!!": "在闪焰队秘密基地彻底击败闪焰队老大弗拉达利",
            "You did it! You saved Kalos! There is nothing else to do except to continue your journey to beat the Kalos Pokémon League!": "你做到了！你拯救了卡洛斯！你只需要继续你的旅程并击败卡洛斯联盟！",
            "What an amazing trainer! You became Kalos Champion! There is a parade in your honor in Lumiose City. But wait, AZ is there asking you for a battle. Show him what being a Pokémon Trainer is like!": "多么厉害的训练家啊！你成为卡洛斯冠军！在密阿雷市举行这为你庆祝的游行。但是，ＡＺ想要和你进行一场战斗，向他展示什么叫做宝可梦训练家！"
        }
    },
    "Princess Diancie": {
        "name": "蒂安希公主",
        "description": {
            "Princess Diancie has been spotted in Kalos! She's searching for something.": "有人发现蒂安希公主在卡洛斯!她正在找某些东西."
        },
        "descriptions": {
            "Capture or hatch 100 Fairy-type Pokémon to follow Diancie's Fairy Aura.": "捕捉或孵化100只妖精属性宝可梦，跟随蒂安希的妖精气场",
            "Defend Diancie from the attacking ninja in Shalour City.": "在娑罗市保护蒂安希免受忍者的攻击",
            "Diancie has escaped to the shopping mall in Lumiose City, but is under attack again!": "蒂安希逃到密阿雷市的购物中心，但再次遭到袭击",
            "Diancie has fled to the Diamond Domain. Dig in the Underground to find it.": "蒂安希逃到了钻石矿国，在地下矿场挖掘到它",
            "Millis and Argus Steel let you do the hard work while they set up an ambush in Shalour City.": "弥莉丝和阿尔盖斯让你去干苦活，而他们在娑罗市设了埋伏",
            "Millis and Argus Steel fled but their Aegislash stayed behind. Look for it in Shalour City and find out what it wants!": "弥莉丝和阿尔盖斯逃跑了，但他们的坚盾剑怪留下了。去娑罗市寻找它，看看它想要什么！",
            "Diancie needs help building a Heart Diamond to stabilize the Diamond Domain. Gather some Fairy Gems for her.": "蒂安希需要建造一颗心钻来稳定钻石矿国。为她收集一些仙女宝石",
            "Talk to Princess Diancie in Shalour City.": "前往娑罗市与蒂安希公主谈谈",
            "Capture Diancie in Reflection Cave.": "在镜穴捕捉蒂安希",
            "A rampaging Yveltal is threatening the Diamond Domain! Help Diancie defeat it!": "狂暴的伊裴尔塔尔威胁着钻石矿国！帮助蒂安希打败它！"
        }
    },
    "Clash of Ages": {
        "name": "光环的超魔神",
        "description": {
            "Hoopa is up to something mischievous...": "胡帕正在搞恶作剧……"
        },
        "descriptions": {
            "Catch Hoopa to learn more.": "捕捉胡帕了解更多信息",
            "Talk to Baraz in Kiloude City.": "前往奇楠市与巴尔札谈谈",
            "Defeat 100 Psychic-type Pokémon.": "击败100只超能力属性宝可梦",
            "That didn't work. Talk to Baraz in Kiloude City.": "但这行不通。前往奇楠市与巴尔札谈谈",
            "Capture or hatch 100 Psychic-type Pokémon.": "捕捉或孵化100只超能力属性宝可梦",
            "That didn't work either. Talk to Baraz in Kiloude City.": "这也没起作用。前往奇楠市与巴尔札谈谈",
            "Catch 100 Hoopa.": "捕捉100只胡帕",
            "This is ridiculous. Talk to Baraz in Kiloude City.": "这太荒谬了。前往奇楠市与巴尔札谈谈",
            "Defeat the Unbound Hoopa and its summoned defenders near Kiloude City.": "前往奇楠市附近击败胡帕（解放）和它召唤的宝可梦",
            "Defeat the Unbound Hoopa and its summoned defenders near Shalour City.": "前往娑罗市附近击败胡帕（解放）和它召唤的宝可梦",
            "Defeat the Unbound Hoopa and its summoned defenders near Lumiose City.": "前往密阿雷市附近击败胡帕（解放）和它召唤的宝可梦",
            "Defeat the Unbound Hoopa and its summoned defenders near Anistar City.": "前往百刻市附近击败胡帕（解放）和它召唤的宝可梦",
            "Defeat the Unbound Hoopa and its summoned defenders near Laverre City.": "前往香薰市附近击败胡帕（解放）和它召唤的宝可梦",
            "Defeat the Unbound Hoopa near Kiloude City, this time for real.": "前往奇楠市附近击败胡帕（解放），这次是真的"
        }
    },
    "An Unrivaled Power": {
        "name": "无与伦比的力量",
        "description": {
            "It has been said that Mewtwo can Mega Evolve. Search for clues on how to find its Mega Stones, so you can control this unrivaled power.": "据说超梦可以进行Mega进化。寻找线索，找到它的Mega进化石，这样你就能掌控这无与伦比的力量"
        },
        "descriptions": {
            "Red might know something. Fight him at Indigo Plateau Kanto then ask him what he knows.": "赤红可能知道些什么。前往关都石英高原和他对战，然后问他知道些什么",
            ".....right. Of course..... Well, you have no leads for now, so may as well defeat and catch some Psychic and Fighting-type Pokémon.": "当然……你现在还没有线索，所以不妨打败和抓住一些超能力属性和格斗属性的宝可梦",
            "Defeat 1500 Psychic-type Pokémon.": "击败1500只超能力属性宝可梦",
            "Capture or hatch 600 Psychic-type Pokémon.": "捕捉或孵化600只超能力属性宝可梦",
            "Defeat 750 Fighting-type Pokémon.": "击败750只格斗属性宝可梦",
            "Capture or hatch 300 Fighting-type Pokémon.": "捕捉或孵化300只格斗属性宝可梦",
            "Blue has contacted you, saying he knows something but wants a fight first. He is at Viridian City.": "青绿联系了你，说他知道些什么但想和你进行一场对战。他在常青市等着你",
            "Talk to Blue in Viridian City.": "前往常青市与青绿谈谈",
            "Look for Blue's old rival in Cerulean Cave": "前往华蓝洞窟寻找青绿的老对手",
            "You eventually found a trainer standing where Mewtwo once did in Cerulean Cave. Talk to Green.": "你最终在超梦曾经待过的华蓝洞窟中找到了一个训练家。和碧蓝谈谈",
            "It seems Green is irritated that you caught Mewtwo before she could. Defeat her in Cerulean Cave.": "碧蓝似乎很生气，因为你在他之前抓住了超梦。前往华蓝洞窟击败他",
            "Talk to Green in Cerulean Cave.": "前往华蓝洞窟与碧蓝谈谈",
            "Talk to Anomaly Mewtwo in Cerulean Cave.": "前往华蓝洞窟与异常的超梦谈谈",
            "Mewtwo wishes to find a place it can live undisturbed. You know of such a place, but it seems unwilling to listen. Defeat Anomaly Mewtwo near Cerulean Cave so you may attempt to talk to it.": "超梦希望找一个不受打扰的地方生活。你知道这样一个地方，但它似乎不愿意听。前往华蓝洞窟附近击败异常的超梦，这样你就可以尝试和它交谈了",
            "It escaped to the west. Defeat Anomaly Mewtwo again.": "它逃到了西方。再次击败异常的超梦",
            "It changed form and flew off in the direction of the sea. Defeat Anomaly Mewtwo yet again.": "它改变了形状，朝大海的方向飞去了。再次击败异常的超梦",
            "It flew off to the peak of a great mountain. Defeat Anomaly Mewtwo yet again.": "它飞到了一座大山的山顶上。再次击败异常的超梦",
            "It flew off to a faraway region to hide in a large city. Defeat Anomaly Mewtwo yet again.": "它飞到一个遥远的地方，躲在一个大城市里。再次击败异常的超梦",
            "Talk to Anomaly Mewtwo in Pokémon Village.": "前往宝可梦村与异常的超梦谈谈",
            "Gather the Great Twisted Spoon, Psychic Gems, and Fighting Gems for Mewtwo.": "为超梦收集弯曲的汤匙，超能宝石，和格斗宝石",
            "Find the Great Twisted Spoon in P2 Lab.": "前往Ｐ２实验室 寻找弯曲的汤匙",
            "Gain 60,000 Psychic gems.": "获得60000个超能力宝石",
            "Gain 60,000 Fighting gems.": "获得60000个格斗宝石",
            "Defeat Anomaly Mewtwo in Pokémon Village.": "前往宝可梦村击败异常的超梦"
        }
    },
    "Welcome to Paradise, Cousin!": {
        "name": "欢迎来到天堂!",
        "description": {
            "Time to kick off your Alolan vacation! See the sights around Melemele Island.": "是时候开始你的阿罗拉假期了！参观美乐美乐岛周围的景点"
        },
        "descriptions": {
            "Protect the mysterious girl's Pokémon! Battle the Spearow near the Ruins of Conflict.": "保护神秘女孩的宝可梦！在战争遗迹附近与烈雀战斗",
            "Ask the mysterious girl if she's okay.": "询问神秘女孩是否安好",
            "Follow Lillie to the Trainers' School dungeon and clear it.": "跟随莉莉艾前往训练家学校地牢并清理它",
            "Beat up the Team Skull grunts loitering on Hau'oli City's Dock.": "在好奥乐市的码头打败闲逛的骷髅队小兵",
            "Battle Ilima in Hau'oli City.": "在好奥乐市与伊利马战斗",
            "Clear Ilima's Trial at Verdant Cavern.": "在葱郁洞窟完成伊利马的考验",
            "Lillie needs your help. Continue past Route 3 and clear Melemele Meadow.": "莉莉艾需要你的帮助。继续通过３号道路并清理美乐美乐花园",
            "Nebby escaped into a hole! Clear the Seaward Cave dungeon.": "小星云逃到了一个洞里！清理通海洞穴地牢",
            "The Ultra Recon Squad is awaiting a battle in Seaward Cave. Show them the thrill of the fight!": "究极调查队正在通海洞穴等待一场战斗。向他们展示一场刺激的战斗！",
            "Return Nebby to Lillie in Melemele Meadow.": "在美乐美乐花园将小星云还给莉莉艾",
            "Lillie still has something on her mind. Talk to her in Iki Town.": "莉莉艾心里还有事。在利利小镇与她交谈",
            "Defeat Hala in Iki Town to complete Melemele's Grand Trial!": "在利利小镇击败哈拉，完成美乐美乐岛的大考验！",
            "There is one more Z Crystal on Ten Carat Hill. Find the Trial Site and claim it!": "在十克拉山丘上还有一个Ｚ纯晶。找到考验地点并获取它！"
        }
    },
    "Symbiotic Relations": {
        "name": "共生关系",
        "description": {
            "Help Lillie and Nebby on Akala Island and meet some friendly faces.": "帮助阿卡拉岛上的莉莉艾和小星云并结识一些友好的面孔"
        },
        "descriptions": {
            "Plan out your course of action with Lillie in Heahea City.": "在慷待市与莉莉艾计划你的行动路线",
            "Clear Lana's Trial at Brooklet Hill.": "在潺潺之丘完成水莲的考验",
            "The Ultra Recon Squad is investigating an oddly familiar tree. Go check it out on Route 5.": "究极调查队正在调查一个奇怪而熟悉的树。去５号道路查看",
            "Team Skull is causing trouble on Route 6! Looks like they haven't learned their lesson.": "骷髅队在６号道路制造麻烦！看来他们还没吸取教训",
            "Clear Kiawe's Trial at Wela Volcano Park.": "在维拉火山公园完成卡奇的考验",
            "Clear Mallow's Trial at Lush Jungle.": "在树荫丛林完成玛奥的考验",
            "Talk to Professor Burnet in Heahea City after you've finished exploring Lush Jungle.": "探索树荫丛林后，在慷待市与芭内特博士交谈",
            "You hear the echoes of bad rap and low self-esteem in the distance. Clear Diglett's Tunnel.": "你远处听到了糟糕说唱和低自尊的回音。清理地鼠隧道",
            "Reach Kahuna Olivia and Lillie at the Ruins of Life and complete Akala's Grand Trial!": "到达生命遗迹与岛屿之王丽姿和莉莉艾会面并完成阿卡拉的大考验！",
            "A strange creature has appeared in Aether Paradise. Make it go away. Clear the Ultra Wormhole.": "在以太乐园中出现了一个奇怪的生物。赶走它，清理究极之洞"
        }
    },
    "Child of the Stars": {
        "name": "传说的宇宙宝可梦",
        "description": {
            "Learn more about Nebby's origins with Lillie on Ula'Ula Island.": "在乌拉乌拉岛向莉莉艾进一步了解小星云的起源"
        },
        "descriptions": {
            "Read about the legends of Alola with Lillie in Malie City.": "在马利埃静市与莉莉艾一起了解阿罗拉的传说",
            "Team Skull are trying to steal a bus stop sign on Route 10! This misdeed won't go unpunished!": "骷髅队试图在１０号道路偷走公交站牌！这种行为不会不受惩罚！",
            "Clear Sophocles's Trial at Hokulani Observatory.": "在辉克拉尼天文台完成索马玛内的考验",
            "Team Skull are being annoying. Get rid of them. Beat their boss Guzma in the Malie Garden dungeon.": "骷髅队又来捣乱了。赶走他们。在马利埃庭园地牢打败他们的老大古兹马",
            "Lillie has run into a Team Skull grunt at Aether House. Politely beat up his Pokémon.": "莉莉艾在以太之家遇到了一个骷髅队手下。礼貌地打败他的宝可梦",
            "Clear Acerola's Trial at Thrifty Megamart.": "在超值超市旧址完成阿塞萝拉的考验",
            "Team Skull have stolen the Yungoos from Aether House. Raid their base. Clear the Po Town dungeon.": "骷髅队从以太之家偷走了猫鼬少。突袭他们的基地。清理魄镇地牢",
            "Team Skull have stolen Nebby! Battle Gladion at Aether House.": "骷髅队偷走了小星云！在以太之家与格拉吉欧战斗",
            "Kahuna Nanu is challenging you to a Grand Trial in Malie City! Test your strength before you go to Aether by defeating him.": "队长默丹在马利埃静市道馆对你进行大考验！在前往以太之家前通过击败他来测试你的实力",
            "Aether president Lusamine has recruited Team Skull and is using Nebby to open an Ultra Wormhole. Stop her. Clear the Aether Foundation dungeon.": "以太理事长露莎米奈招募了骷髅队并利用小星云开启了超空洞。阻止她。清理以太基金会地牢",
            "Aether Branch Faba's ego is blocking your way. Defeat him in the Aether Foundation dungeon to get closer to Lusamine.": "以太分部长扎奥博的自负阻碍了你的前进。在以太基金会地牢击败他，接近露莎米奈",
            "Ya boy Guzma is here. Defeat him in the Aether Foundation dungeon. Lusamine is next.": "古兹马也在这里。在以太基金会地牢打败他。下一个是露莎米奈",
            "Lusamine is using Nebby to open an Ultra Wormhole! Defeat her in the Aether Foundation dungeon to put a stop to this.": "露莎米奈利用小星云开启了超空洞！在以太基金会地牢打败她，阻止这一切",
            "Talk to Lillie and Gladion at Aether Paradise when you're ready to go to the next island.": "准备前往下一个岛屿时，在以太乐园与莉莉艾和格拉吉欧交谈",
            "Talk to Lillie.": "与莉莉艾交谈",
            "Talk to Gladion.": "与格拉吉欧交谈",
            "There are more Z Crystals on Ula'ula. Find the Trial Site hidden in Haina Desert after clearing the Route.": "在乌拉乌拉岛上还有更多Ｚ纯晶。清理完道路后，在哈伊纳沙漠中找到隐藏的考验场",
            "Get the Steelium Z. Defeat Molayne in Hokulani Observatory.": "获得钢系Ｚ纯晶。在辉克拉尼天文台击败马睿因"
        }
    },
    "Emissary of Light": {
        "name": "光之使者",
        "description": {
            "Seek out the Pokémon of Alola's legends on Poni Island.": "在波尼岛寻找阿罗拉传说中的神奇宝贝"
        },
        "descriptions": {
            "Explore Poni Island for signs of its kahuna. Clear Ancient Poni Path.": "在波尼岛探索岛屿之王的踪迹。清理波尼古道",
            "Talk to Hapu at the Ruins of Hope.": "在彼岸遗迹与哈普乌交谈",
            "Hapu has permitted you to visit sacred ground. Find the other flute by clearing Exeggutor Island Hill.": "哈普乌允许你参观圣地。通过清理椰蛋树岛山丘找到另一支笛子",
            "Team Skull are being annoying again. Settle the score with them near Vast Poni Canyon.": "骷髅队又来捣乱了。在波尼大峡谷附近解决这个问题",
            "Proceed to Vast Poni Canyon and prove your skills in a Grand Trial against Poni's new kahuna, Hapu!": "前往波尼大峡谷并在波尼岛新岛屿之王哈普乌的大考验中证明你的实力！",
            "Clear the ancient Trial Site of Vast Poni Canyon.": "清理波尼大峡谷的古老考验场",
            "Choose a time of day to play a flute with Lillie at the Altar.": "选择一个时间与莉莉艾在祭坛上吹笛子",
            "Play the Sun Flute during Day or Dusk.": "在白天或黄昏吹奏太阳之笛",
            "Play the Moon Flute during Night or Dawn.": "在夜晚或黎明吹奏月亮之笛",
            "Help Lillie get through to her mother! Defeat Lusamine at the Altar of the Sunne and Moone.": "帮助莉莉艾理解她的母亲！在日月祭坛打败露莎米奈",
            "Everyone is finally safe. Talk to Lillie.": "大家终于安全了。与莉莉艾交谈"
        }
    },
    "Eater of Light": {
        "name": "食光者",
        "description": {
            "A dangerous Pokémon from another world threatens the Alola region.": "来自另一个世界的危险宝可梦威胁着阿罗拉地区"
        },
        "descriptions": {
            "Stop the Eater of Light from absorbing all light in Alola. Defeat Ultra Necrozma at the Altar of the Sunne and Moone.": "阻止光之食者吸收阿罗拉所有的光。在日月祭坛击败究极奈克洛兹玛",
            "Everyone is finally safe again. Talk to Lillie.": "大家再次安全了。与莉莉艾交谈",
            "You are challenged by Pokémon Trainer Lillie! Welcome her to the world of trainers by battling her at the Altar of the Sunne and Moone.": "宝可梦训练家莉莉艾挑战你！在日月祭坛与她进行战斗，欢迎她加入训练家的世界",
            "Clear Mina's Trial at Mina's Houseboat.": "在茉莉的船屋完成茉莉的考验",
            "Battle Gladion on Ula'ula one last time before ascending to the Pokémon League.": "在乌拉乌拉岛与格拉吉欧最后一次战斗，然后前往宝可梦联盟",
            "One step closer to victory: Clear Mount Lanakila!": "距离胜利更近一步：清理拉纳基拉山！",
            "You were so distracted by Necrozma you forgot about the Z Crystal! Find the Trial Site in the Mount Lanakila dungeon.": "你被奈克洛兹玛分心忘记了Ｚ纯晶！在拉纳基拉山地牢找到考验场"
        }
    },
    "Island Challenge": {
        "name": "诸岛巡礼",
        "description": {
            "Embark on the Island Challenge and be graced by the Tapus' presence!": "开始诸岛巡礼，感受卡璞们的魅力"
        },
        "descriptions": {
            "Start your Island Challenge at Professor Kukui's Lab.": "从库库伊博士实验室开始你的诸岛巡礼"
        }
    },
    "Typing some Memories": {
        "name": "记录一些存储碟",
        "description": {
            "Help Gladion restore his Silvally's memories.": "帮助格拉吉欧恢复他的银伴战兽的存储碟"
        },
        "descriptions": {
            "Talk to Gladion in the Aether Foundation.": "前往以太基金会与格拉吉欧交谈",
            "Get some training before looking for Silvally's memories. Catch or hatch 100 Fighting, Rock, Dark and Fairy Types": "在寻找银伴战兽的存储碟之前先接受一些训练。捕捉或孵化100只格斗、岩石、恶和妖精属性宝可梦",
            "Capture or hatch 100 Fighting-type Pokémon.": "捕捉或孵化100只格斗属性宝可梦",
            "Capture or hatch 100 Rock-type Pokémon.": "捕捉或孵化100只岩石属性宝可梦",
            "Capture or hatch 100 Dark-type Pokémon.": "捕捉或孵化100只恶属性宝可梦",
            "Capture or hatch 100 Fairy-type Pokémon.": "捕捉或孵化100只妖精属性宝可梦",
            "Start your search for Silvally's memories by asking important people around Alola.": "通过询问阿罗拉周围的重要人物，开始你对银伴战兽存储碟的搜索",
            "Talk to important people around Melemele Island.": "前往美乐美乐岛周围与重要人物谈谈",
            "Talk to important people around Akala Island.": "前往阿卡拉岛周围与重要人物谈谈",
            "Talk to important people around Ula'ula Island.": "前往乌拉乌拉岛周围与重要人物谈谈",
            "Talk to important people around Poni Island.": "前往波尼岛周围与重要人物谈谈",
            "Talk to Gladion in the Aether Foundation and tell him what you found out about Silvally's memories.": "和以太基金会的格拉吉欧谈谈，告诉他你发现的关于银伴战兽存储碟的事情",
            "You probably need to train a little before going looking for more of Silvally memories. Catch or hatch 100 Water, Grass, Fire, Electric, Ground and Ice types.": "你可能需要在寻找更多银伴战兽的存储碟之前进行一些训练。捕捉或孵化100只水、草、火、电、地面和冰属性宝可梦",
            "Capture or hatch 100 Water-type Pokémon.": "捕捉或孵化100只水属性宝可梦",
            "Capture or hatch 100 Grass-type Pokémon.": "捕捉或孵化100只草属性宝可梦",
            "Capture or hatch 100 Fire-type Pokémon.": "捕捉或孵化100只火属性宝可梦",
            "Capture or hatch 100 Electric-type Pokémon.": "捕捉或孵化100只电属性宝可梦",
            "Capture or hatch 100 Ground-type Pokémon.": "捕捉或孵化100只地面属性宝可梦",
            "Capture or hatch 100 Ice-type Pokémon.": "捕捉或孵化100只冰属性宝可梦",
            "Search for Silvally's Memory near pools of freshwater. Ask Gladion at Aether Foundation if you're lost.": "在淡水池边寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Buy the Water Memory from Captain Lana with Dungeon Tokens.": "用地牢代币向队长水莲购买清水存储碟",
            "Search for Silvally's Memory in overgrown forests. Ask Gladion at Aether Foundation if you're lost.": "在杂草丛生的森林中寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Buy the Grass Memory from Captain Mallow with Quest Points.": "用任务点数向队长玛奥购买青草存储碟",
            "Search for Silvally's Memory near fiery hotspots. Ask Gladion at Aether Foundation if you're lost.": "在火热的热点附近搜索银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Buy the Fire Memory from Captain Kiawe with Battle Points.": "用战斗点数向队长卡奇购买火焰存储碟",
            "Search for Silvally's Memory in electrical institutions. Ask Gladion at Aether Foundation if you're lost.": "在电气机构中搜索银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Buy the Electric Memory from Captain Sophocles with Pokédollars.": "用宝可币从队长马玛内那里购买电子存储碟",
            "Search for Silvally's Memory near snow-covered peaks. Ask Gladion at Aether Foundation if you're lost.": "在白雪覆盖的山峰附近寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Buy the Ice Memory from Veteran Aristo with Diamonds.": "用钻石从资深训练家英倬那里购买冰雪存储碟",
            "Search for Silvally's Memory in isolated ground. Ask Gladion at Aether Foundation if you're lost.": "在与世隔绝的土地上寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Buy the Ground Memory from Kahuna Hapu with Farm Points.": "用农场点数从岛屿女王哈普乌购买大地存储碟",
            "Go show Gladion those memories you've bought in the Aether Foundation": "前往以太基金会给格拉吉欧看看你买的那些存储碟",
            "Get some training before looking for more of Silvally's memories. Catch or hatch 100 Bug, Flying, Poison, Ghost, Psychic, Steel and Dragon types.": "在寻找更多银伴战兽的存储碟之前，先接受一些训练。捕捉或孵化100只虫，飞行，毒，幽灵，超能，钢和龙属性宝可梦",
            "Capture or hatch 100 Bug-type Pokémon.": "捕捉或孵化100只虫属性宝可梦",
            "Capture or hatch 100 Flying-type Pokémon.": "捕捉或孵化100只飞行属性宝可梦",
            "Capture or hatch 100 Poison-type Pokémon.": "捕捉或孵化100只毒属性宝可梦",
            "Capture or hatch 100 Ghost-type Pokémon.": "捕捉或孵化100只幽灵面属性宝可梦",
            "Capture or hatch 100 Psychic-type Pokémon.": "捕捉或孵化100只超能属性宝可梦",
            "Capture or hatch 100 Steel-type Pokémon.": "捕捉或孵化100只钢属性宝可梦",
            "Capture or hatch 100 Dragon-type Pokémon.": "捕捉或孵化100只龙属性宝可梦",
            "Search for Silvally's Memory where pests make their home. Ask Gladion at Aether Foundation if you're lost.": "寻找银伴战兽关于虫属性的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Defeat Guzma to get the Memory back.": "打败古兹马找回存储碟",
            "Search for Silvally's Memory where the earth opens to the sky. Ask Gladion at Aether Foundation if you're lost.": "在大地向天空敞开的地方寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Defeat Kahili to get the Memory back.": "打败卡希丽找回存储碟",
            "Search for Silvally's Memory near an ancient trial. Ask Gladion at Aether Foundation if you're lost.": "在古代审判地附近寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Defeat Plumeria to get the Memory back.": "打败布尔美丽找回存储碟",
            "Search for Silvally's Memory near an abandoned village. Ask Gladion at Aether Foundation if you're lost.": "在一个废弃的村庄附近寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Defeat Captain Acerola to get the Memory back.": "打败队长阿塞萝拉找回存储碟",
            "Search for Silvally's Memory in a modern haven. Ask Gladion at Aether Foundation if you're lost.": "在一个现代的避风港里寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Defeat Aether Branch Chief Faba to get the Memory back.": "打败以太分部长扎奥博找回存储碟",
            "Search for Silvally's Memory near a steel dome. Ask Gladion at Aether Foundation if you're lost.": "在一个钢穹顶附近寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Defeat Molayne to get the Memory back.": "打败马睿因找回存储碟",
            "Search for Silvally's Memory near a tree. Ask Gladion at Aether Foundation if you're lost.": "在一棵树附近寻找银伴战兽的存储碟。如果你迷路了，可以前往以太基金会询问格拉吉欧",
            "Defeat Ryuki to get the Memory back.": "打败龙葵找回存储碟",
            "Go talk to Gladion in the Aether Foundation and tell him you've recovered all the Silvally Memories!": "前往以太基金会与格拉吉欧谈谈，告诉他，你恢复了银伴战兽的所有存储碟"
        }
    },
    "Ultra Beast Hunt": {
        "name": "寻找究极异兽",
        "description": {
            "Track down the mysterious Ultra Beasts": "追踪神秘的究极异兽"
        },
        "descriptions": {
            "Talk to Looker at the Roadside Motel.": "前往路尚汽车旅馆与帅哥谈谈",
            "Defeat Agent Anabel at the Roadside Motel.": "在路尚汽车旅馆击败特工莉拉",
            "Talk to Anabel at the Roadside Motel.": "前往路尚汽车旅馆与莉拉谈谈",
            "Talk to Looker at the Roadside Motel to learn about Beast Balls.": "前往路尚汽车旅馆与帅哥谈谈，了解究极球的情况",
            "Capture Nihilego 1 times!  Nihilego has been spotted at Wela Volcano Park and Diglett's Tunnel!": "捕捉一只虚吾伊德！虚吾伊德出现在维拉火山公园和地鼠隧道！",
            "Rare Ultra Beasts have been spotted!\nBuzzwole in Melemele Meadow and Pheromosa in Verdant Cavern!": "究极异兽已被发现！美乐美乐花园里的爆肌蚊及葱郁洞窟里的费洛美螂！",
            "Capture Buzzwole 2 times! ": "捕捉2只爆肌蚊！",
            "Capture Pheromosa 4 times! ": "捕捉4只费洛美螂！",
            "Defeat Trial Captain Mina at the Roadside Motel.": "在路尚汽车旅馆击败队长茉莉",
            "Talk to Captain Mina at the Roadside Motel.": "前往路尚汽车旅馆与队长茉莉谈谈",
            "Capture Xurkitree 2 times!  Xurkitree has been spotted at Memorial Hill and Lush Jungle!": "捕捉2只电束木！电束木出现在回忆之丘和树荫丛林！",
            "Talk to Kahuna Nanu at the Roadside Motel.": "前往路尚汽车旅馆与队长默丹谈谈",
            "Rare Ultra Beasts have been spotted! Kartana at Malie Garden and Route 17, and Celesteela at Malie Garden and Haina Desert!": "究极异兽已被发现！马利埃庭园和１７号道路的纸御剑及马利埃庭园和哈伊纳沙漠里的铁火辉夜！",
            "Capture Kartana 4 times! ": "捕捉4只纸御剑！",
            "Capture Celesteela 2 times! ": "捕捉2只铁火辉夜！",
            "Defeat Kahuna Nanu at the Roadside Motel.": "在路尚汽车旅馆击败队长默丹",
            "Rare Ultra Beasts have been spotted! Blacephalon and Stakataka are both at Poni Grove!": "究极异兽已被发现！波尼树林里的砰头小丑和垒磊石！",
            "Capture Blacephalon 5 times! ": "捕捉5只砰头小丑！",
            "Capture Stakataka 5 times! ": "捕捉5只垒磊石！",
            "Catch Guzzlord at Resolution Cave.": "前往终结洞窟捕捉恶食大王！"
        }
    },
    "Magikarp Jump": {
        "name": "跳跃吧，鲤鱼王",
        "description": {
            "Go to Hoppy Town and share their love for Magikarp.": "去跳跃镇，分享他们对鲤鱼王的爱"
        },
        "descriptions": {
            "Use the subregion travel to talk to Mayor Karp in Hoppy Town.": "利用次区域旅行与跳跃镇的卡普镇长谈谈"
        }
    },
    "The Darkest Day": {
        "name": "暗夜",
        "description": {
            "Stop the return of the Darkest Day!": "阻止暗夜的回归"
        },
        "descriptions": {
            "Check out Stow-on-Side's mural.": "看看溯传镇的壁画",
            "Stop Bede from destroying the mural!": "阻止彼特毁掉壁画",
            "The mural was destroyed! See what you can learn by inspecting the ruins and speaking to the bystander.": "壁画已被摧毁！检查废墟以及与旁观者交谈，看看你能学到什么",
            "": "",
            "Talk to Sonia.": "与索妮亚谈谈",
            "Defeat the next gym and catch up with Hop.": "击败下一个道馆，赶上赫普的脚步",
            "Continue your Gym Challenge and have a battle with Hop in Circhester.": "继续你的道馆挑战，在战竞镇与赫普进行一场战斗",
            "Learn more about the heroes who stopped The Darkest Day.": "了解更多关于阻止暗夜的英雄",
            "Talk to Hop.": "与赫普谈谈",
            "Continue your Gym Challenge and gain entry to the Champion Cup.": "继续你的道馆挑战，获取冠军杯的入场证",
            "Defeat Marnie at Wyndon Stadium to reach the quarter-finals of the Champion Cup.": "在宫门竞技场击败玛俐来进入冠军杯的四分之一决赛",
            "Defeat Bede to reach the semi-finals of the Champion Cup.": "击败彼特来进入冠军杯半决赛",
            "Defeat Hop to reach the final of the Champion Cup!": "击败赫普来进入冠军杯决赛",
            "Champion Leon was seen heading to Rose Tower. Ascend Rose Tower so you can find him.": "冠军丹帝被看到去洛兹大厦了。攀登洛兹大厦去找到他",
            "The Championship Match is about to start, but Chairman Rose is broadcasting something to the Stadium? Listen to the broadcast.": "冠军赛就要开始了，但洛兹会长正在广播些什么东西？听听广播",
            "Talk to Hop in Wyndon Stadium.": "前往宫门竞技场与赫普谈谈",
            "Chairman Rose has interrupted your fight with Leon and brought about the Darkest Day. Clear Slumbering Weald Shrine.": "洛兹会长带来的闇夜中断了你和丹帝的决斗。通关微寐森林神社",
            "Talk to Hop in Slumbering Weald Shrine.": "前往微寐森林神社与赫普谈谈",
            "Unfortunately, all you found at the Slumbering Weald was a rusty sword and shield. Go to the Energy Plant in Hammerlocke to put an end to Chairman Rose's plans!": "不幸的是，你在微寐森林只找到一把腐朽的剑和盾。前去拳关市的能源工厂终止洛兹会长的计划",
            "Talk to Chairman Rose in Energy Plant": "前往能源工厂与洛兹会长谈谈",
            "Leon failed to capture Eternatus. Defeat it before it can cause any more damage!": "丹帝捕捉无极汰那失败了，击败它避免造成更多影响",
            "Eternatus has ascended to its Eternamax form! Catch it to put an end to the Darkest Day!": "无极汰那提升到极巨化形态，捉住它，结束闇夜",
            "After all those interruptions, it's finally time for the Championship match! Talk to Leon at Wyndon Stadium.": "在所有这些干扰之后，终于到冠军赛的时间了！和宫门竞技场的丹帝谈谈",
            "Defeat Leon to become the Champion of Galar!": "击败丹帝并且成为伽勒尔冠军"
        }
    },
    "Sword and Shield": {
        "name": "剑与盾",
        "description": {
            "Stop the weapons from making a mess.": "别弄乱武器"
        },
        "descriptions": {
            "Talk to Hop in the Slumbering Weald.": "前往微寐森林与赫普谈谈",
            "Hop wants to fight you one more time at Slumbering Weald Shrine.": "赫普想在微寐森林神社再进行一场战斗",
            "Talk to Sordward & Shielbert in the Slumbering Weald.": "前往微寐森林与索德与西尔迪谈谈",
            "A pair with weird hair has taken the Rusted Sword and Rusted Shield. Defeat them to take them back.": "两位奇怪头发的人拿走了腐朽的剑和腐朽的盾。打败他们，将剑盾夺回",
            "Defeat Sordward.": "击败索德",
            "Defeat Shielbert.": "击败西尔迪",
            "Sordward and Shielbert are forcing Pokémon to rampage in Galar's Stadiums. First is a Tsareena in Turffield Stadium. Defeat it.": "索德与西尔迪强迫宝可梦在伽勒尔各大竞技场发狂。首先是草路竞技场的甜冷美后，击败它",
            "Sordward and Shielbert have forced a Gyarados to rampage in Hulbury Stadium. Defeat it as well.": "索德与西尔迪强迫暴鲤龙在水舟竞技场发狂，击败它",
            "Sordward and Shielbert have forced a Torkoal to rampage in Motostoke Stadium. Defeat it as well.": "索德与西尔迪强迫煤炭龟在机擎竞技场发狂，击败它",
            "Talk to Sordward & Shielbert in Wedgehurst.": "前往木杆镇与索德与西尔迪谈谈",
            "Sordward and Shielbert are trying to steal the Wishing Stars at Professor Magnolia's Lab in Wedgehurst. Stop them.": "索德与西尔迪想偷取木杆镇木兰博士实验室的许愿星，阻止他们",
            "Sordward and Shielbert have forced a Conkeldurr and a Dusknoir to rampage in Stow-on-Side Stadium. Defeat them both.": "索德与西尔迪迫使修建老匠和黑夜魔灵在溯传竞技场里横冲直撞，打败他们",
            "Defeat Conkeldurr.": "击败修建老匠",
            "Defeat Dusknoir.": "击败黑夜魔灵",
            "There were rampaging Pokémon at Ballonlea Stadium, but Bede already defeated them. There are no more rampaging Pokémon for now, and he wants to battle.": "舞姿竞技场还有一些发狂的宝可梦，但彼特已经击败它们。现在已经没有发狂的宝可梦，他想与你一战",
            "Sordward and Shielbert have forced a Gigalith and a Froslass to rampage in Circhester Stadium. Defeat them both": "索德与西尔迪迫使庞岩怪和雪妖女在战竞竞技场里横冲直撞，打败他们",
            "Defeat Gigalith.": "击败庞岩怪",
            "Defeat Froslass.": "击败雪妖女",
            "There are no more rampaging Pokémon for now and Marnie wants to battle you in Spikemuth.": "暂时没有更多的发狂的宝可梦了。玛俐想在尖钉镇挑战你",
            "Sordward and Shielbert have forced a Haxorus to rampage in Hammerlocke Stadium. Hopefully this is the last one.": "索德与西尔迪强迫一只双斧战龙在拳关市发狂。希望这是最后一只",
            "Talk to Sordward & Shielbert in the Energy Plant.": "前往能源工厂与索德与西尔迪谈谈",
            "Sordward and Shielbert are trying to use the Rusted Sword and Shield to make Zacian and Zamazenta go on a rampage in Energy Plant. Stop them.": "索德与西尔迪试图用腐朽的剑、盾让苍响和藏玛然特在能源工厂里横冲直撞，阻止他们",
            "Zacian and Zamazenta are rampaging in Energy Plant. Defeat them!": "苍响和藏玛然特在能源工厂里横冲直撞，击败他们",
            "Defeat Zacian.": "击败苍响",
            "Defeat Zamazenta.": "击败藏玛然特",
            "Talk to Piers in the Energy Plant.": "前往能源工厂与聂梓谈谈",
            "Now that they have calmed down, Zacian and Zamazenta seem to be willing to let you try to catch them!": "现在他们已经冷静下来了，苍响和藏玛然特似乎愿意让你去捕捉他们！",
            "Catch Zacian.": "捕捉苍响",
            "Catch Zamazenta.": "捕捉藏玛然特"
        }
    },
    "The Dojo's Armor": {
        "name": "武馆的铠甲",
        "description": {
            "Obtain the Secret Armor of the Master Dojo.": "获得马师傅武馆的秘密铠甲"
        },
        "descriptions": {
            "Talk to Mustard at the Master Dojo.": "前往马师傅武馆与马士德谈谈",
            "Mustard wants to test your ability at the Master Dojo. Defeat him.": "马士德想在马师傅武馆测试你的能力，击败他",
            "Capture Galarian Slowpoke 6 times.": "捕捉 伽勒尔 呆呆兽 6次",
            "It seems Mustard still wants to talk to you? Talk to Mustard again at the Master Dojo.": "看来马士德还想和你谈谈？再次前往马师傅武馆找她谈谈",
            "Talk to Klara and Avery in Warm-Up Tunnel.": "去热身洞穴找克拉拉和赛宝利谈谈",
            "Talk to Klara.": "与克拉拉谈谈",
            "Talk to Avery.": "与赛宝利谈谈",
            "You, Klara and Avery have happened upon the same Max Mushroom in Warm-Up Tunnel. Defeat them both to win it.": "你、克拉拉和赛宝利在热身洞穴里碰到了相同的极巨菇菇，打败他们就能胜利",
            "Defeat Klara.": "击败克拉拉",
            "Defeat Avery.": "击败赛宝利",
            "Talk to Klara and Avery in the Master Dojo.": "去马师傅武馆找克拉拉和赛宝利谈谈",
            "For the final trial, you must defeat both Klara and Avery on the Master Dojo Battle Court.": "最后的测试，你必须在马师傅武馆决斗场击败克拉拉和赛宝利",
            "Defeat Avery": "击败赛宝利",
            "Capture Kubfu.": "捕捉熊徒弟",
            "Train Kubfu by defeating Dark and Water-type Pokémon.": "击败恶属性和水属性宝可梦以训练熊徒弟",
            "Defeat 500 Dark-type Pokémon.": "击败500只恶属性宝可梦",
            "Defeat 500 Water-type Pokémon.": "击败500只水属性宝可梦",
            "Train Kubfu more by catching or hatching Dark and Water-type Pokémon.": "捕捉或孵化恶属性和水属性宝可梦以训练熊徒弟",
            "Capture or hatch 250 Dark-type Pokémon.": "捕捉或孵化250只恶属性宝可梦",
            "Capture or hatch 250 Water-type Pokémon.": "捕捉或孵化250只水属性宝可梦",
            "Level up Kubfu in both of the Towers of Two Fists to obtain Urshifu!": "在恶之塔和水之塔分别进化熊徒弟，以获得武道熊师！",
            "Capture Urshifu (Single Strike).": "捕捉武道熊师 (一击流)",
            "Capture Urshifu (Rapid Strike).": "捕捉武道熊师 (连击流)",
            "Talk to Mustard at one of the Towers of Two Fists.": "在任一双拳塔中与马士德谈谈"
        }
    },
    "Secrets of the Jungle": {
        "name": "丛林的秘密",
        "description": {
            "Discover the secrets of the jungle.": "寻找丛林的秘密"
        },
        "descriptions": {
            "Ash Ketchum wants to talk to you at the Master Dojo.": "小智想和你在马师傅武馆谈谈",
            "Talk to Ash Ketchum's friend, Koko, in Glimwood Tangle.": "前往迷光森林与小智的朋友可可谈谈",
            "Catch the missing Zarude roaming around the Isle of Armor.": "捕捉失踪的萨戮德，他在铠之孤岛漫游",
            "Take Zarude back to Koko in Glimwood Tangle.": "带着萨戮德回到迷光森林的可可身边",
            "A group of Zarude are attacking you. Defeat them.": "一队萨戮德开始攻击你，击败它们",
            "Talk to Koko in Glimwood Tangle.": "前往迷光森林与可可谈谈",
            "Another two groups of Zarude are attacking you. Defeat them as well.": "另外两队萨戮德开始攻击你，也击败它们",
            "Talk to Ash Ketchum at the Master Dojo.": "前往马师傅武馆与小智谈谈",
            "Defeat Ash Ketchum outside the Master Dojo.": "击败马师傅武馆外的小智",
            "A final Zarude wants to challenge you. Defeat Zarude (Dada).": "最终形态的萨戮德想挑战你，击败萨戮德（阿爸）",
            "Talk to Ash Ketchum in Glimwood Tangle.": "前往迷光森林与小智谈谈",
            "Play with Flowering Celebi.": "与花朵时拉比玩耍"
        }
    },
    "The Crown of Galar": {
        "name": "伽勒尔的王冠",
        "description": {
            "Help the ancient king of Galar, Calyrex, return to its former glory.": "帮助古代伽勒尔王，蕾冠王，恢复昔日的荣耀"
        },
        "descriptions": {
            "Talk to Peony to find out about the ancient king of Galar.": "与皮欧尼交谈，了解古代伽勒尔王的情况",
            "A mysterious Pokémon has appeared and challenged you to a battle.": "一只神秘的宝可梦出现并向你发起了挑战",
            "The Pokémon you just fought has possessed Peony. Talk to it.": "和你刚刚战斗的宝可梦附身到了皮欧尼上，和他谈谈",
            "Calyrex is going to Old Cemetery and Snowslide Slope to grow a Shaderoot Carrot and an Iceroot Carrot. Protect it from wild Pokémon so it can concentrate.": "蕾冠王要去远古墓地和雪中溪谷栽种黑萝卜和冰萝卜，保护他免受野生宝可梦的侵害，这样它就可以集中精力",
            "Old Cemetery": "远古墓地",
            "Snowslide Slope": "雪中溪谷",
            "After growing both carrots, Calyrex has returned to Freezington. Talk to it.": "种完两种胡萝卜后，蕾冠王回到了冻凝村。和他谈谈",
            "Fight Calyrex's steeds to get them out of Freezington!": "和蕾冠王的马进行战斗，把他们赶出冻凝村！",
            "Defeat Spectrier.": "击败灵幽马",
            "Defeat Glastrier.": "击败雪暴马",
            "Talk to Calyrex again.": "再次和蕾冠王谈谈",
            "Spectrier and Glastrier are now roaming the Crown Tundra. Catch them when the opportunity arises!": "灵幽马和雪暴马正在王冠雪原上漫游。机会出现时捕捉他们",
            "Capture Spectrier.": "捕捉灵幽马",
            "Capture Glastrier.": "捕捉雪暴马",
            "Now that you have captured both of its steeds, talk to Calyrex at the Crown Shrine.": "你已经捕捉了两匹马，去王冠神殿找蕾冠王谈谈",
            "Now that you have found and caught Glastrier and Spectrier, Calyrex wants to challenge you at Crown Shrine. Catch it!": "你已经找到并捕捉了雪暴马和灵幽马, 蕾冠王想在王冠神殿挑战你，捕捉他",
            "Now that you have captured Calyrex, go report back to Peony!": "你已经捕捉了蕾冠王，回去向皮欧尼报告！"
        }
    },
    "The Birds of the Dyna Tree": {
        "name": "巨树丘陵的鸟类宝可梦",
        "description": {
            "Find the Legendary birds of the Dyna Tree.": "找到巨树丘陵的传说鸟类宝可梦"
        },
        "descriptions": {
            "Talk to Peony to find out about some legendary bird sightings.": "与皮欧尼谈谈，了解一些传说中的鸟类宝可梦目击事件",
            "Some unknown bird Pokémon have been sighted near Dyna Tree Hill in Ballimere Lake. Explore the area to see for yourself.": "有人在球湖湖畔旁的巨树丘陵看见了一些未知的鸟类宝可梦。探索该地区，亲眼看看",
            "You witnessed 3 powerful looking bird pokemon resembling Articuno, Zapdos, and Moltres fighting over the fruit of the Dyna Tree. Upon noticing you, they attack!": "你看到了3只看起来很强大的鸟类宝可梦，类似于急冻鸟、闪电鸟和火焰鸟正在争夺巨树的果实。一旦注意到你，他们就会攻击！",
            "Tell Peony about your encounter with the birds resembling Articuno, Zapdos, and Moltres.": "告诉皮欧尼你遇到类似急冻鸟、闪电鸟和火焰鸟的鸟类宝可梦",
            "Galarian Articuno, Zapdos, and Moltres have fled to the Crown Tundra, Southern Galar, and the Isle of Armor respectively. Search for them.": "伽勒尔急冻鸟伽、勒尔闪电鸟和伽勒尔火焰鸟分别逃到了王冠雪原、伽勒尔南部和铠之孤岛，寻找他们",
            "Search for Galarian Articuno in the Crown Tundra.": "前往王冠雪原寻找伽勒尔急冻鸟",
            "Search for Galarian Zapdos in the Wild Area of Southern Galar.": "前往伽勒尔南部的旷野地带寻找伽勒尔闪电鸟",
            "Search for Galarian Moltres in the Isle of Armor.": "前往铠之孤岛寻找伽勒尔火焰鸟",
            "You defeated Galarian Articuno, Zapdos, and Moltres multiple times each. Ask Peony what to do next.": "你多次击败伽勒尔急冻鸟、伽勒尔闪电鸟和伽勒尔火焰鸟，咨询皮欧尼下一步应该做什么",
            "Galarian Articuno, Zapdos, and Moltres are now roaming in the Crown Tundra, Southern Galar, and the Isle of Armor respectively. Catch them when the opportunity arises!": "伽勒尔急冻鸟伽、勒尔闪电鸟和伽勒尔火焰鸟现在分别在王冠雪原、伽勒尔南部和铠之孤岛漫游，机会出现时捕捉他们！",
            "Capture Galarian Articuno.": "捕捉伽勒尔急冻鸟",
            "Capture Galarian Zapdos.": "捕捉伽勒尔闪电鸟",
            "Capture Galarian Moltres.": "捕捉伽勒尔火焰鸟",
            "Now that you have captured Galarian Articuno, Zapdos, and Moltres, go report back to Peony!": "你已经捕捉了伽勒尔急冻鸟、伽勒尔闪电鸟和伽勒尔火焰鸟，回去向皮欧尼报告"
        }
    },
    "The Ancient Golems": {
        "name": "古老的神柱",
        "description": {
            "Discover the ancient Golems in the ruins of the Crown Tundra.": "在王冠雪原的废墟中发现古老的神柱"
        },
        "descriptions": {
            "Talk to Peony to find out about some ancient ruins.": "和皮欧尼谈谈，了解一些古代遗迹",
            "Peony told you of a peculiar ruin located at Three-Point Pass. Explore the area to find it.": "皮欧尼告诉过你，在三岔口有一处奇特的废墟。探索该地区并找到它",
            "The ruins were locked, go report back to Peony.": "废墟被锁住了，回去向皮欧尼报告",
            "Clear Rock Peak Ruins, Iceberg Ruins, and Iron Ruins 10 times each.": "分别清理巨人睡榻岩山遗迹、雪中溪谷冰山遗迹和巨人睡榻黑金遗迹10次",
            "Clear Rock Peak Ruins 10 times.": "清理岩山遗迹10次",
            "Clear Iceberg Ruins 10 times.": "清理冰山遗迹10次",
            "Clear Iron Ruins 10 times.": "清理黑金遗迹10次",
            "The ruins are still locked, report to Peony.": "废墟依旧被锁着，向皮欧尼报告",
            "Catch Regirock, Regice, and Registeel in the Rock Peak Ruins, Iceberg Ruins, and Iron Ruins respectively.": "分别捕捉巨人睡榻岩山遗迹里的雷吉洛克、雪中溪谷冰山遗迹里的雷吉斯奇鲁和巨人睡榻黑金遗迹里的雷吉斯奇鲁",
            "Capture Regirock.": "捕捉雷吉洛克",
            "Capture Regice.": "捕捉雷吉艾斯",
            "Capture Registeel.": "捕捉雷吉斯奇鲁",
            "You have captured Regirock, Regice, and Registeel, now go report back to Peony.": "你已经抓住了雷吉洛克、雷吉斯奇鲁和雷吉斯奇鲁，现在回去向皮欧尼报告",
            "After you caught three of the legendary golems it created, Regigigas appeared in Giant's Bed. Defeat and catch it!": "捕捉三神柱后，雷吉奇卡斯出现在巨人睡榻。击败并捕捉他",
            "Defeat Regigigas at Giant's Bed!": "前往巨人睡榻击败雷吉奇卡斯！",
            "Capture Regigigas.": "捕捉雷吉奇卡斯",
            "You have captured Regigigas, now go report back to Peony.": "你已经抓住了雷吉奇卡斯，现在回去向皮欧尼报告",
            "Now that it has finally unlocked, catch Regieleki and Regidrago in the Split-Decision Ruins!": "终于解锁了，在抉择遗迹中捕捉雷吉艾勒奇和雷吉铎拉戈",
            "Capture Regieleki.": "捕捉雷吉艾勒奇",
            "Capture Regidrago.": "捕捉雷吉铎拉戈",
            "You finally captured Regieleki and Regidrago. Go report back to Peony!": "你终于抓住了雷吉艾勒奇和雷吉铎拉戈，回去向皮欧尼报告"
        }
    },
    "The Lair of Giants": {
        "name": "极巨巢穴",
        "description": {
            "Explore the Max Lair and discover the Gigantamax Pokémon.": "探索极巨巢穴并发现极巨化宝可梦"
        },
        "descriptions": {
            "Peony's daughter, Peonia, wants to talk to you in Freezington.": "皮欧尼的女儿夏科娅，想和你谈谈，请前往在冻凝村",
            "Clear Max Lair to encounter a Gigantamax Pokémon.": "清理极巨巢穴，遇到一个极巨化宝可梦",
            "Report back to Peonia in Max Lair.": "前往极巨巢穴向夏科娅汇报情况",
            "Obtain 1 Wishing Piece": "获得1个许愿星块",
            "Obtain 2 Wishing Pieces": "获得2个许愿星块",
            "Obtain 4 Wishing Pieces": "获得4个许愿星块",
            "Obtain 6 Wishing Pieces": "获得6个许愿星块",
            "Obtain 9 Wishing Pieces": "获得9个许愿星块",
            "Obtain 12 Wishing Pieces": "获得12个许愿星块",
            "Obtain 16 Wishing Pieces": "获得16个许愿星块",
            "Obtain 20 Wishing Pieces": "获得20个许愿星块",
            "Obtain 25 Wishing Pieces": "获得25个许愿星块",
            "Obtain 30 Wishing Pieces": "获得30个许愿星块",
            "Obtain 36 Wishing Pieces": "获得36个许愿星块",
            "Obtain 42 Wishing Pieces": "获得42个许愿星块",
            "Obtain 49 Wishing Pieces": "获得49个许愿星块",
            "Obtain 56 Wishing Pieces": "获得59个许愿星块",
            "Obtain 64 Wishing Pieces": "获得64个许愿星块",
            "Obtain 72 Wishing Pieces": "获得72个许愿星块",
            "Obtain 81 Wishing Pieces": "获得81个许愿星块",
            "Obtain 90 Wishing Pieces": "获得90个许愿星块",
            "Obtain 100 Wishing Pieces": "获得100个许愿星块",
            "Obtain 110 Wishing Pieces": "获得110个许愿星块",
            "Obtain 121 Wishing Pieces": "获得121个许愿星块",
            "Obtain 132 Wishing Pieces": "获得132个许愿星块",
            "Obtain 144 Wishing Pieces": "获得144个许愿星块",
            "Obtain 156 Wishing Pieces": "获得156个许愿星块",
            "Obtain 169 Wishing Pieces": "获得169个许愿星块",
            "Obtain 182 Wishing Pieces": "获得182个许愿星块",
            "Obtain 196 Wishing Pieces": "获得196个许愿星块",
            "Obtain 210 Wishing Pieces": "获得210个许愿星块",
            "Obtain 225 Wishing Pieces": "获得225个许愿星块",
            "Obtain 240 Wishing Pieces": "获得240个许愿星块",
            "You've finally obtained enough Wishing Pieces to attract every Gigantamax Pokémon to the Max Lair! Tell Peonia about your achievement in Max Lair.": "你终于获得了足够的许愿星块，以吸引所有极巨化宝可梦汇集到极巨巢穴！在极巨巢穴告诉夏科娅你获得的成就",
            "It seems something is going on in Hammerlocke! Talk to Leon in Energy Plant.": "拳关市好像发生了什么事！前往能源工厂与丹帝谈谈",
            "Eternamax Eternatus has appeared in the Energy Plant yet again! Bring it down once more.": "极巨化无极汰那又出现在能源工厂了！再一次击败它",
            "You defeated Eternamax Eternatus once more. Talk to Leon in Energy Plant.": "你再次击败极巨化无极汰那，前往能源工厂与丹帝谈谈",
            "Go back to the Max Lair to tell Peonia what happened.": "返回极巨巢穴巢告诉夏科娅发生了什么"
        }
    },
    "Incarnate Forces of Hisui": {
        "name": "具现洗翠之力",
        "description": {
            "Cogita would like you to catch the Forces of Nature.": "吾思想让你抓住大自然的力量"
        },
        "descriptions": {
            "Speak to Cogita in Galaxy Hall.": "前往银河队总部与吾思交谈",
            "Tornadus, Thundurus and Landorus have been sighted in the Alabaster Icelands, Cobalt Coastlands and Obsidian Fieldland respectively. Pursue and capture them.": "龙卷云，雷电云和土地云最近在纯白冻土，群青海岸和黑曜原野出没。追寻并捕捉他们",
            "Pursue Tornadus in the Alabaster Icelands.": "前往纯白冻土寻找龙卷云",
            "Catch Tornadus in the Alabaster Icelands": "前往纯白冻土捕捉龙卷云",
            "Pursue Thundurus in the Cobalt Coastlands.": "前往群青海岸寻找雷电云",
            "Catch Thundurus in the Cobalt Coastlands": "前往群青海岸寻找雷电云",
            "Pursue Landorus in the Obsidian Fieldlands.": "前往黑曜原野寻找土地云",
            "Catch Landorus in the Obsidian Fieldlands": "前往黑曜原野寻找土地云",
            "Speak to Cogita at Ancient Retreat.": "前往古昔隐居地与吾思交谈",
            "Pursue Enamorus in the Crimson Mirelands.": "在红莲湿地追寻眷恋云",
            "Catch Enamorus roaming around Hisui.": "洗翠地区漫游捕捉眷恋云"
        }
    },
    "Arceus: The Deified Pokémon": {
        "name": "阿尔宙斯：宝可梦之神",
        "description": {
            "Discover the truth of the Pokémon deity, Arceus.": "探索宝可梦之神——阿尔宙斯的真相"
        },
        "descriptions": {}
    },
    "Path of Legends": {
        "name": "传奇之路",
        "description": {
            "Help Arven search for the Herba Mystica.": "帮助派帕寻找神秘草"
        },
        "descriptions": {
            "Arven wants to test you and himself. Defeat him at Poco Path Lighthouse": "派帕想考验你和他自己。前往小匙小径灯塔击败他"
        }
    },
    "Victory Road": {
        "name": "冠军之路",
        "description": {
            "Challenge Paldea's Gyms to challenge your new rival, Nemona.": "挑战帕底亚的道馆，最终挑战你的新对手妮莫"
        },
        "descriptions": {
            "Finally, it's time to fight Nemona as equals! Defeat Champion Nemona in Mesagoza.": "终于，是时候平等地和妮莫战斗了！前往桌台市击败冠军妮莫"
        }
    },
    "Starfall Street": {
        "name": "流星街",
        "description": {
            "Help Cassiopeia disband Team Star.": "帮助仙后解散天星队"
        },
        "descriptions": {
            "Penny has revealed herself to be Cassiopeia. Defeat her at Naranjuva Academy.": "牡丹已经暴露了自己是仙后。在橘子学院打败她"
        }
    },
    "The Way Home": {
        "name": "回家的路",
        "description": {
            "Help Koraidon and Miraidon find their homes in the mysterious Area Zero.": "帮助故勒顿和密勒顿在神秘的第零区找到他们的家"
        },
        "descriptions": {}
    },
    "Egg Hunt": {
        "name": "复活节彩蛋游戏",
        "description": {
            "A basket of strange eggs has been spotted, see if you can find it!": "一篮奇怪的蛋被发现了，看看你能找到它吗！"
        },
        "descriptions": {
            "Some strange eggs have been seen around Kanto. Go look for it! Maybe Erika knows more?": "在关都地区附近看到了一些奇怪的鸡蛋。去找吧！也许莉佳知道的更多？",
            "Seems like this was just an Easter egg after all... But no time to dwell on that. Another report just came in, there have been sightings of some strange eggs in a forest in Johto!": "这似乎只是一个复活节彩蛋……但没时间细想了。刚收到另一份报告显示，有人在城都的森林里看到了一些奇怪的蛋！",
            "That looked like a Togepi!... well, maybe not. Anyway, there is a big Egg Hunt going on in the woods south of Rustboro in Hoenn; maybe you should take a look?": "那看起来像只波克比！好吧，也许不是。总之，在丰源卡那兹市南部的树林里正在进行一场大型的寻蛋活动，也许你应该去看看？",
            "The eggs ran away! Talk to the egg hunter in Petalburg Woods.": "蛋跑了！前往卡绿森林与蛋猎人谈谈"
        }
    },
    "How blu mouse?": {
        "name": "蓝色老鼠？",
        "description": {
            "Apparently a strange blue mouse-like Pokémon might be out there somewhere?": "显然，一只奇怪的蓝色老鼠模样的宝可梦可能在藏在某处？"
        },
        "descriptions": {
            "Catch Pikablu.": "捕捉玛力露"
        }
    },
    "Dr. Splash's Research Project": {
        "name": "苏普拉研究员的研究项目",
        "description": {
            "Help Dr. Splash unlock the full potential of your Magikarp.": "帮助苏普拉研究员释放鲤鱼王的全部潜力"
        },
        "descriptions": {
            "Talk to Dr. Splash in Hoppy Town.": "与跳跃镇的苏普拉研究员谈谈",
            "Gather berries for Dr. Splash.": "为苏普拉研究员收集树果",
            "Harvest 129 Oran Berries at the farm.": "在农场收获129个Oran树果",
            "Harvest 129 Sitrus Berries at the farm.": "在农场收获129个Sitrus树果",
            "Harvest 129 Pecha Berries at the farm.": "在农场收获129个Pecha树果",
            "Harvest 129 Rindo Berries at the farm.": "在农场收获129个Rindo树果",
            "Harvest 129 Wacan Berries at the farm.": "在农场收获129个Wacan树果",
            "Harvest 129 Leppa Berries at the farm.": "在农场收获129个Leppa树果",
            "Harvest 129 Rawst Berries at the farm.": "在农场收获129个Rawst树果",
            "Harvest 129 Aspear Berries at the farm.": "在农场收获129个Aspear树果",
            "Harvest 129 Razz Berries at the farm.": "在农场收获129个Razz树果",
            "Harvest 129 Bluk Berries at the farm.": "在农场收获129个Bluk树果",
            "Report back to Dr. Splash about your berry research.": "向苏普拉研究员汇报你的树果研究",
            "Gather materials for Dr. Splash.": "为苏普拉研究员收集材料",
            "Gain 5,000 Ground gems.": "获得5000个地面宝石",
            "Catch or hatch 10 Spoink.": "捕捉或孵化10只跳跳猪",
            "Gain 5,000 Grass gems.": "获得5000个草之宝石",
            "Gain 5,000 Rock gems.": "获得5000个岩石宝石",
            "Catch or hatch 10 Voltorb.": "捕捉或孵化10只霹雳电球",
            "Buy 100,000 Poké Balls.": "购买100000精灵球",
            "Gain 5,000 Ice gems.": "获得5000个冰之宝石",
            "Return to Dr. Splash in Hoppy Town with the training materials.": "带着培训材料，回到跳跃镇与苏普拉研究员谈谈",
            "Catch Pokémon for Dr. Splash's training grounds.": "为苏普拉研究员的训练场捕捉宝可梦",
            "Catch or hatch 10 Dwebble.": "捕捉或孵化10只石居蟹",
            "Catch or hatch 10 Boldore.": "捕捉或孵化10只地幔岩",
            "Catch or hatch 10 Forretress.": "捕捉或孵化10只佛烈托斯",
            "Catch or hatch 10 Golem.": "捕捉或孵化10只隆隆岩",
            "Catch or hatch 10 Steelix.": "捕捉或孵化10只大钢蛇",
            "Return to Dr. Splash in Hoppy Town with the pushable Pokémon.": "带着可推送的宝可梦，回到跳跃镇与苏普拉研究员谈谈",
            "Defeat 5,000 Pokémon": "击败5000只宝可梦",
            "Wrap up your research project by talking to Dr. Splash in Hoppy Town.": "回到跳跃镇和苏普拉研究员交谈，以结束你的研究项目"
        }
    },
    "Let's Go, Meltan!": {
        "name": "去吧 美录坦！",
        "description": {
            "I need your assistance in learning more about the newly discovered Pokémon that has really sent me and other Pokémon researchers into quite a tizzy.": "我需要你的帮助，需要更多地了解新发现的宝可梦，它确实让我和其他研究人员异常的慌乱"
        },
        "descriptions": {
            "Step 1 of Let's Go, Meltan!": "步骤1：去吧！美录坦",
            "Collect 10 items from the Underground mines.": "在地下矿场挖掘矿藏10次",
            "Capture or hatch 50 Pokémon.": "捕捉或孵化50只宝可梦",
            "Step 2 of Let's Go, Meltan!": "步骤2：去吧！美录坦",
            "Hatch 50 Eggs.": "孵化50个宝可梦蛋",
            "Gain 15,000 Farm Points.": "获得15000个农场点数",
            "Step 3 of Let's Go, Meltan!": "步骤3：去吧！美录坦",
            "Catch or hatch 5 Ditto.": "捕捉或孵化5只百变怪",
            "Defeat Elite Molayne in Ula'ula Island 10 times.": "前往乌拉乌拉岛击败 天王 马睿因 10次",
            "Step 4 of Let's Go, Meltan!": "步骤4：去吧！美录坦",
            "Capture or hatch 50 Steel-type Pokémon.": "捕捉或孵化50只钢属性宝可梦",
            "Capture or hatch 50 Electric-type Pokémon.": "捕捉或孵化50只电属性宝可梦",
            "Defeat Elite Olivia in Ula'ula Island 10 times.": "前往乌拉乌拉岛击败 天王 丽姿 10次",
            "Step 5 of Let's Go, Meltan!": "步骤5：去吧！美录坦",
            "Catch or hatch 5 Alolan Grimer.": "捕捉或孵化5只阿罗拉臭泥",
            "Catch or hatch 5 Slugma.": "捕捉或孵化5只熔岩虫",
            "Catch or hatch 10 Gulpin.": "捕捉或孵化10只溶食兽",
            "Step 6 of Let's Go, Meltan!": "步骤6：去吧！美录坦",
            "Buy 10 Master Balls.": "购买10个大师球",
            "Step 7 of Let's Go, Meltan!": "步骤7：去吧！美录坦",
            "Catch or hatch 10 Magnemite.": "捕捉或孵化10只小磁怪",
            "Catch or hatch 10 Exeggcute.": "捕捉或孵化10只蛋蛋",
            "Defeat Elite Acerola in Ula'ula Island 10 times.": "前往乌拉乌拉岛击败 天王 阿塞萝拉 10次",
            "Step 8 of Let's Go, Meltan!": "步骤8：去吧！美录坦",
            "Catch or hatch 15 Drowzee.": "捕捉或孵化15只催眠貘",
            "Catch or hatch 15 Cubone.": "捕捉或孵化15只卡拉卡拉",
            "Catch or hatch 15 Scyther.": "捕捉或孵化15只飞天螳螂",
            "Defeat Elite Kahili in Ula'ula Island 10 times.": "前往乌拉乌拉岛击败 天王 卡希丽 10次",
            "Step 9 of Let's Go, Meltan!": "步骤9：去吧！美录坦",
            "Catch or hatch 20 Kabuto.": "捕捉或孵化20只化石盔",
            "Catch or hatch 20 Omanyte.": "捕捉或孵化20只菊石兽",
            "Collect all buried treasure 30 times in the Underground mines.": "在地下矿场挖掘全部矿藏30次",
            "Step 10 of Let's Go, Meltan!": "步骤10：去吧！美录坦",
            "Catch or hatch 20 Anorith.": "捕捉或孵化20只太古羽虫",
            "Catch or hatch 20 Lileep.": "捕捉或孵化20只触手百合",
            "Catch or hatch 20 Aerodactyl.": "捕捉或孵化20只化石翼龙",
            "Defeat Champion Hau in Ula'ula Island 15 times.": "前往乌拉乌拉岛击败 冠军 哈乌 15次",
            "Let's Go, Meltan!": "去吧！美录坦",
            "Catch 400 Meltan in Alola.": "前往阿罗拉地区捕捉400只美录坦",
            "Defeat Team Rainbow Rocket.": "击败彩虹火箭队"
        }
    },
    "Defeat Rainbow Rocket": {
        "name": "击败彩虹火箭队",
        "description": {
            "Team Rainbow Rocket has stolen the Meltan research! Defeat them to get it back!": "彩虹火箭队偷了美录坦的研究成果！打败他们把它拿回来！"
        },
        "descriptions": {
            "Defeat the Grunts guarding the Aether Foundation takeover.": "击败守护以太基金会的手下",
            "Defeat Aether Branch Chief Faba.": "击败以太分部长扎奥博",
            "Defeat Archie and Maxie.": "击败水梧桐和赤焰松",
            "Defeat Team Aqua Leader Archie.": "击败海洋队队长水梧桐",
            "Defeat Team Magma Leader Maxie.": "击败熔岩队队长赤焰松",
            "Defeat Team Galactic Leader Cyrus.": "击败银河队队长赤日",
            "Defeat Team Flare Leader Lysandre.": "击败闪焰队队长弗拉达利",
            "Defeat Team Plasma Leader Ghetsis.": "击败等离子队队长魁奇思",
            "Defeat Team Rainbow Leader Giovanni.": "击败彩虹队队长坂木"
        }
    }
}
